<html><head>
<title>Download - NPDS V</title><title>

</title></head>
<body bgcolor="#FFFFFF">
<font face=Verdana,Arial,Helvetica size=2> 
<center>
  <font size="2" face="Verdana,Arial,Helvetica"><b>Descargas</b></font>
</center>
</font>
<p><font face=Verdana,Arial,Helvetica size=2><br />
  <br />
  <br />
  Esta funci&oacute;n les permite administrar la aplicaci&oacute;n &quot;<font size="2" face="Verdana,Arial,Helvetica"><b>Descargas</b></font>&quot; de su Portal. Esta funci&oacute;n a puesto que muy utilizada, preste
un cuidado especial a lo que escribe en ella. </font></p>
<p><font face=Verdana,Arial,Helvetica size=2>Se indica una lista de los ficheros actualmente disponibles en <font size="2" face="Verdana,Arial,Helvetica"><b>Descargas</b></font> con el conjunto de la informaci&oacute;n disponible (n&uacute;mero,
  contador, url de cargamento, nombre del fichero...) as&iacute; como los
  v&iacute;nculos permitiendo la modificaci&oacute;n y/o la supresi&oacute;n del fichero.<br />
  <br />
  <br />
  <strong>Edicion de  una </strong><b>Descarga</b><strong>:</strong><br />
Presione el v&iacute;nculo Edicion para poder indicar y modificar la
informaci&oacute;n de la <b>Descarga</b>. Para terminar presionan el bot&oacute;n
salvar.
Pueden cambiar la fecha (actualizaci&oacute;n) y cambiar los privilegios
sobre esta pantalla.<br />
&iexcl;Compruebe su sintaxis as&iacute; como el URL de cargamento!<br />
  <br />
  <strong>Suprimir un fichero:</strong><br />
  Presione el v&iacute;nculo borrar de la <b>Descarga</b> que desean suprimir.
  Un mensaje de confirmaci&oacute;n le pide de validar su petici&oacute;n.<br />
  <br />
  <strong>A&ntilde;adir una </strong><b>Descarga</b><strong>:</strong><br />
  - Insere la URL (externa o interna a su Dominio) o presione Recorrer.  &iexcl;Recorrer permite navegar en su servidor en una una nueva ventana y ' Copiar '
  pone directamente al d&iacute;a el formulario!<br />
- El contador puede ser inicializado con un valor (no &eacute;xag&eacute;re...).<br />
</font>- Para que NPDS calcule autom&aacute;ticamente el tama&ntilde;o del fichero, no
  ponga nada en el campo &quot;tama&ntilde;o del fichero&quot;<br />
  - Versi&oacute;n, tama&ntilde;o, v&iacute;nculo hacia la p&aacute;gina Internet del
  proprietario, nombre del proprietario son campos facultativos.<br />
  - Categor&iacute;a, descripci&oacute;n y privilegios son campos obligatorios.<br />
  <br />
  Nota:<br />
  Para a&ntilde;adir una categor&iacute;a, ponga simplemente un nuevo t&eacute;rmino
  en el campo. Cuidado con los privilegios, An&oacute;nimo permite una <font face=Verdana,Arial,Helvetica size=2><b>Descarga</b></font> por cualquier usuario.</p>
<p><font face=Verdana,Arial,Helvetica size=2><br />
</font></p>
<font face=Verdana,Arial,Helvetica size=2>
<center>
  <img src="../../images/admin/manuels.gif" border="0" /> 
</center>
</font> 
</body>
</html>