<!DOCTYPE html>
<html lang="de">
   <head>
      <meta charset="utf-8" />
      <title>Administration</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
            <ol class="breadcrumb bg-transparent">
               <li><img class="me-3 ms-n3" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></li>
               <li class="breadcrumb-item active" aria-current="page">Administration</li> 
               <li class="breadcrumb-item"><a href="men_gen.html">Men&uuml;</a></li>
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3>Administrationsseite</h3>

         <h4>Einf&uuml;hrung</h4>
         <p>NPDS ist ein franz&ouml;sischer Open-Source-Portalgenerator unter der kostenlosen GNU-GPL-Lizenz mit PHP- und MySql-Technologien, f&uuml;r den in den Einstellungen ein mehrsprachiges Ger&auml;t konfiguriert werden kann. Standardm&auml;&szlig;ig ist das Portal in Franz&ouml;sisch.</p>
         <p>Der Inhalt und die Benutzeroberfl&auml;che dieser Seite h&auml;ngen offensichtlich von den Rechten ab, die Sie als Administrator haben (der Superadministrator hat daher Zugriff auf alle Schnittstellenfunktionen).<br />
         Die allgemeine Schnittstelle ist in 3 Hauptbl&ouml;cke unterteilt.</p>

         <h4>Warnungen und Benachrichtigungen</h4>
         <p>Der erste Block sammelt die Warnungen / Benachrichtigungen, mit denen Sie ausstehende Administratoraufgaben bearbeiten k&ouml;nnen. (vorgeschlagene Artikel, geplante Artikel, Benutzer, die auf Validierung warten, neue Links, defekte Links usw.)</p>
         <h4>Die Funktionen</h4>
         <p>Um NPDS zu verwalten, haben Sie Zugriff auf viele Schaltfl&auml;chen, die nach einer Klassifizierung nach Typ nach Zeilen gruppiert sind. Sie haben die Form von Symbolen oder Text, abh&auml;ngig von der Konfiguration der in den Einstellungen definierten grafischen Oberfl&auml;che.</p>
            <ol>
               <li>Mit den Schaltfl&auml;chen in der ersten Zeile k&ouml;nnen Sie den Inhalt Ihrer Website verwalten. Sobald Sie auf eine Schaltfl&auml;che geklickt haben, m&uuml;ssen Sie auf die manuelle Online-Schaltfl&auml;che klicken, um die Dokumentation zur &Ouml;ffnungsfunktion zu erhalten.</li>
               <li>In der zweiten Zeile k&ouml;nnen Sie Portalbenutzer verwalten</li>
               <li>In der dritten Zeile k&ouml;nnen Sie alles verwalten, was mit Kommunikation zu tun hat</li>
               <li>In der vierten Zeile k&ouml;nnen Sie die Schnittstelle der Bl&ouml;cke verwalten</li>
               <li>In der f&uuml;nften Zeile k&ouml;nnen Sie auf dem System agieren. Der Link "Einstellungen" ist einer der wichtigsten Links. Beachten Sie den Link, &uuml;ber den Sie ein Modul installieren und herausfinden k&ouml;nnen, welche Module bereits installiert sind oder nicht.</li>
               <li>Schlie&szlig;lich die letzte Zeile, in der Sie die mit einer Verwaltung ausgestatteten Module verwalten k&ouml;nnen.</li>
            </ol>
         </p>

         <h4>Die letzten x Artikel</h4>
         <p>
            <ul>
               <li>Zeigt die Liste der letzten x Artikel an, die auf Ihrer Site ver&ouml;ffentlicht wurden</li>
               <li>Die erste Aufzeichnung ist der zuletzt ver&ouml;ffentlichte Artikel</li>
               <li>Bestimmte Artikel k&ouml;nnen im Archiv angegeben werden. Dies sind die Artikel, deren Ver&ouml;ffentlichungsdatum abgelaufen ist.</li>
               <li>Um diese Artikel wieder in den Feed aufzunehmen, m&uuml;ssen Sie sie nur bearbeiten, auf die Option "Datum &auml;ndern" klicken und ihr Enddatum &auml;ndern.</li>
               <li>Klicken Sie auf den Artikel, um ihn zu bearbeiten, oder verwenden Sie die Links Bearbeiten, L&ouml;schen.</li>
               <li>Wenn Sie ein altes Element bearbeiten / l&ouml;schen m&ouml;chten, geben Sie seine ID ein und w&auml;hlen Sie die entsprechende Aktion aus.</li>
            </ul>
         </p>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Administrationshandbuch</span></p>
      </div>
   </body>
</html>