<!DOCTYPE html>
<html lang="de">
   <head>
      <meta charset="utf-8" />
      <title>meta-Tags</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
            <ol class="breadcrumb bg-transparent">
               <li><a href="admin.html"><img class="me-3 ms-n3" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></a></li>
               <li class="breadcrumb-item"><a href="men_gen.html">Men&uuml;</a></li> 
               <li class="breadcrumb-item"><a href="men_syst.html">System</a></li>
               <li class="breadcrumb-item active" aria-current="page" >meta-Tags</li> 
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3>Administration - meta-Tags</h3>

         <h4>meta-Tags</h4>
         <p>meta-Tags sind spezielle Tags in der HTML-Sprache. Sie erm&ouml;glichen insbesondere die Referenzierung Ihrer Website durch Suchmaschinen wie Altavista, Yahoo oder Hotbot. Mehr als die H&auml;lfte der Internetnutzer nutzen Suchmaschinen, daher ist es wichtig, auf die SEO Ihrer Website zu achten, damit diese korrekt angezeigt wird.</p>
         <p>Bitte beachten Sie, dass meta-Tags nicht abgeschnitten werden d&uuml;rfen: Wir kehren bei diesem Tag-Typ nicht zur Zeile zur&uuml;ck!. Verwenden Sie daher nicht &lt;br /&gt; in den Formularfeldern.</p>

         <h4>Gemeinsamer Meta-tags</h4>
         <p><b>meta &quot;Author&quot;</b><br />
         Dieser Tag <u>wird nicht genutz</u> von Suchmaschinen. Nur Nomade nutzt es.</p>
         <p><b>meta &quot;Owner&quot;</b><br />
         Dieser Tag zeigt den Webseitenbesitzer und den Autor.</p>
         <p><b>meta &quot;Reply-to&quot;</b><br />
         Dieser Tag enth&auml;lt die E-mail Adresse des Autors. Es erlaubt den Besuchern Ihrer Seite Sie zu kontaktieren</p>
         <p><b>meta &quot;Description&quot;</b><br />
         Dieser Tag enth&auml;lt die Beschreibung Ihrer Webseite. Nur ein Satz!. Und nicht mehr als 200 Buchstaben!.</p>
         <p><b>meta &quot;Keywords&quot;</b><br />
         Dieser Tag enth&auml;lt die Schl&uuml;sselworte Ihrer Webseite. Benutzen Sie Kommas um sie zu trennen. Sie k&ouml;nnen 100 Worte, oder 100 Buchstaben verwenden.</p>
         <p><b>meta &quot;Rating&quot;</b><br />
         Das ist die Zielgruppe Ihrer Seite. F&uuml;r Alle, f&uuml;r &fnof;ltere, oder &cedil;ber 14 Jahre</p>
         <p><b>Meta &quot;Distribution&quot;</b><br />
         Einstellung der Seite: f&uuml;r Alle (Global) oder eingeschr&auml;nkt (Lokal).</p>
         <p><b>meta &quot;Copyright&quot;</b> <br />
         Dieser Tag <u>wird nicht verwendet</u> von Suchmaschinen, aber er enth&auml;lt die Copyright Informationen.</p>
         <p><b>meta &quot;Robots&quot;</b><br />
         Damit informieren Sie die Robots (gesendet von Suchmaschinen) wie sie Ihre Seite indexieren k&ouml;nnen, oder nicht, wenn Sie die Seite wieder durchsuchen... .</p>
         <p><b>meta &quot;Revisit-After&quot;</b><br />
         Wenn die Robots Ihre Seite wieder besuchen. Nicht vor 2 Wochen.</p>

         <h4>Andere meta-tags </h4>
         <p><b>meta &quot;Content-Type&quot;</b><br />
         Informiert den Browser &cedil;ber die Spracheinstellung: zum Beispiel (text/html; charset=iso-8859-1).</p>
         <p><b>meta &quot;Content-Script-Type&quot;</b><br />
         Damit wird der Browser informiert, welche Scripts verwendet werden( text/javascript).</p>
         <p><b>meta &quot;Content-Style-Type&quot;</b><br />
         Informirert den Browser, welche Style in Ihrer Seite verwendet werden ( text/css).</p>
         <p><b>meta &quot;Identifier-url&quot;</b><br />
         Dieser Tag enth&auml;lt die Seiten URL.</p>
         <p><b>meta &quot;Generator&quot;</b><br />
         Wird nicht von Suchmaschinen verwendet. Zeigt an, womit Sie Ihre Webseite erzeugt haben.</p>
         <p><b>meta &quot;Pragma&quot;</b><br />
         Deaktiviert den Seitencache (meist f&uuml;r Netscape).No-cache meint, dass die Seite nicht gecachet wird (sinnvoll f&uuml;r PHP Seiten, wenn es dauernd Updates gibt)</p>
         <h5>meta-Tags mit og- (Open Graph) und Twitter-Eigenschaften</h5>
          <p>Diese Tags richten sich speziell an soziale Netzwerke. Sie erm&ouml;glichen die automatische Anzeige von Informationen (Titel, Beschreibung, Bild usw.) Ihrer Website in sozialen Netzwerken. Wir haben 6 davon implementiert, um die wichtigsten sozialen Netzwerke standardm&auml;&szlig;ig abzudecken.</p>
          <ul>
             <li><b>og:type</b><br />Kontexttyp auf Website festgelegt</li>
             <li><b>og:url</b><br />Website-URL</li>
             <li><b>og:title</b><br />Seitentitel</li>
             <li><b>og:description</b><br />Site-Beschreibung</li>
             <li><b>og:image</b><br />Site-Bild<br /> Hinweis: Sie k&ouml;nnen Ihr Bild ausw&auml;hlen, indem Sie die URL und den Dateinamen beibehalten: <code>/images/ogimg.jpg</code></li>
             <li><b>twitter:card</b><br />auf Zusammenfassung gesetzt</li>
          </ul>
         <h4>&lt;title&gt; Tags (Sonderfall)</h4>
         <p><b>Titel</b><br />
         Alle Seiten einer Webseite ben&ouml;tigen einen Titel, das ist effizient f&uuml;r Suchmaschinen. Mit NPDS, ist der Setentitel f&uuml;r alle Seiten gleich. Sie k&ouml;nnen es in den Einstellungen, oder in der pages.php einstellen (/themes directory);. Verwenden Sie nicht mehr als 100 Buchstaben!</p>
         <p>Notiz : Nutzung von Schl&uuml;sselworten im Titel ist eine gute Idee. Ihre Seite wird so besser indexiert.</p>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Administrationshandbuch</span></p>
      </div>
   </body>
</html>