<!DOCTYPE html>
<html lang="de">
   <head>
      <meta charset="utf-8" />
      <title>Weblinks</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
            <ol class="breadcrumb bg-transparent">
               <li><a href="admin.html"><img class="me-3 ms-n3" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></a></li>
               <li class="breadcrumb-item"><a href="men_gen.html">Men&uuml;</a></li> 
               <li class="breadcrumb-item"><a href="men_contenu.html">Inhalt</a></li>
               <li class="breadcrumb-item active" aria-current="page" >Weblinks</li> 
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3 class="mb-3">Weblinks</h3>
         <p>Dies ist eine bedeutende Anwendung in NPDS.<br />
         Damit k&ouml;nnen Sie eine Yahoo &auml;hnlichen Linkindex erstellen, mit einer eigenen integrierten Suche.</p>

         <h4>Wartende Links</h4>
         <p>Wenn ein Link auf die Freigebe wartet...<br />
         Sie k&ouml;nnen den Title, die URL, den Kommentar, den Namen und die E-mail Adresse des Linkeinsenders, sowie die Kategorie einstellen. <br />
         Dann k&ouml;nnen Sie den Link hinzuf&uuml;gen (<i>Add</i>) oder nicht (<i>Delete</i>).</p>

         <h4>Link DB reinigen</h4>
         <p>Stellt die Bewertungen der Links auf null zur&uuml;ck.</p>

         <h4>Tote Links meldem</h4>
         <p>Das sind die Optionen :
            <ul>
               <li><i>Ignore</i> l&ouml;scht die Meldungen zu toten Links.</li>
               <li><i>Delete</i> entfernt tote Links und die dazu abgegebenen Bewertungen.</li>
            </ul>
         </p>

         <h4>Linkangeben &auml;ndern</h4>
         <p>F&uuml;r jeden Link haben Sie die original URL (die in der Datenbank gespeichert ist) und die neue URL.<br />
         Optionen sind :
            <ul>
               <li><i>Ignore</i> l&ouml;scht alle Anfragen zum vorhandenen Link.</li>
               <li><i>Delete</i> l&ouml;scht tote Links und f&uuml;gt die neuen URLs hinzu.</li>
            </ul>
         </p>
         <h4>Eine Hauptkategorie hinzuf&uuml;gen</h4>
         <p>Um die Links zu strukturieren, geben Sie einen Titel und eine Beschreibung ein (alphabetisch geordnet).</p>

         <h4>Unterkategorie hinzuf&uuml;gen</h4>
         <p>Um die Links zu strukturieren, geben Sie eine Unterkategorie ein und ordnen Sie sie einer Hauptkategorie zu (eine Ebene / alphabetisch sortiert).</p>

         <h4>Neuen Link hinzuf&uuml;gen</h4>
         <p>Geben Sie den Titel ein <b>(Sie k&ouml;nnen HTML Code verwenden (br, img src (local or no), ...) wenn Sie wollen)</b>, URL, Kategorie (und Unterkategorie), Beschreibung, Name und E-mail des Melders. Klicken Sie auf <i>Add</i>.</p>

         <h4>Kategorie &auml;ndern</h4>
         <p>Sie k&ouml;nnen den Namen einer Kategorie (Unterkategorie) &auml;ndern. <br />
         Sie k&ouml;nnen auch eine Kategorie (unterkategorie) l&ouml;schen inclusive der enthaltenen Elemente,</p>

         <h4>Links &auml;ndern</h4>
         <p>NPDS zeigt alle in der Datenbank vorhandenen Links an. Klicken Sie auf einen Link, um ihn zu &auml;ndern.<br />
         Sie k&ouml;nnen alle Parameter &auml;ndern, oder den Link l&ouml;schen.</p>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Administrationshandbuch</span></p>
      </div>
   </body>
</html>