<h2>CHARTE D'UTILISATION DU SITE</h2>
<p>Il vous est demand&eacute; de prendre connaissance de la <strong>charte</strong> suivante avant de participer.</p>
<p>[french]Pour conna&icirc;tre et exercer vos droits notamment de retrait de votre consentement &agrave; l'utilisation des donn&eacute;es collect&eacute;es veuillez consulter notre <a href="static.php?op=politiqueconf.html&amp;npds=1&amp;metalang=1">politique de confidentialit&eacute;</a>.[/french][english]To know and exercise your rights, in particular to withdraw your consent to the use of the data collected, please consult our <a href="static.php?op=politiqueconf.html&amp;npds=1&amp;metalang=1">privacy policy</a>.[/english][spanish]Para conocer y ejercer sus derechos, en particular para retirar su consentimiento para el uso de los datos recopilados, consulte nuestra <a href="static.php?op=politiqueconf.html&amp;npds=1&amp;metalang=1">pol&iacute;tica de privacidad</a>.[/spanish][german]Um Ihre Rechte zu kennen und auszu&uuml;ben, insbesondere um Ihre Einwilligung zur Nutzung der erhobenen Daten zu widerrufen, konsultieren Sie bitte unsere <a href="static.php?op=politiqueconf.html&amp;npds=1&amp;metalang=1">Datenschutzerkl&auml;rung</a>.[/german][chinese]&#x8981;&#x4E86;&#x89E3;&#x5E76;&#x884C;&#x4F7F;&#x60A8;&#x7684;&#x6743;&#x5229;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x8981;&#x64A4;&#x56DE;&#x60A8;&#x5BF9;&#x6240;&#x6536;&#x96C6;&#x6570;&#x636E;&#x7684;&#x4F7F;&#x7528;&#x7684;&#x540C;&#x610F;&#xFF0C;&#x8BF7;&#x67E5;&#x9605;&#x6211;&#x4EEC;<a href="static.php?op=politiqueconf.html&#x26;npds=1&#x26;metalang=1">&#x7684;&#x9690;&#x79C1;&#x653F;&#x7B56;</a>&#x3002;[/chinese]</p>

<h3>ACCEPTATION DES CONDITIONS GENERALES D'UTILISATION</h3>
<p>Ce site est un site d'informations et de services en langue fran&ccedil;aise.<br />
L'acc&egrave;s au site pour la simple consultation est libre et anonyme.<br />
Les visiteurs anonymes peuvent acc&eacute;der &agrave; tous les forums "publics".<br />
L'inscription se fait par la simple cr&eacute;ation gratuite d'un compte de membre, vous acceptez alors les conditions d'utilisation r&eacute;gies par le pr&eacute;sent document.</br>
Ce site est soumis &agrave; la loi fran&ccedil;aise.</p>
<h3>PUBLICATION DE MESSAGES</h3>
<p>Nous vous demandons de bien vouloir :
<ul>
   <li>Respecter le sujet trait&eacute; dans chaque forum.</li>
   <li>Faire une recherche pr&eacute;alable avant de poster un sujet d&eacute;j&agrave; trait&eacute; &agrave; maintes reprises.</li>
   <li>Choisir un titre r&eacute;sumant pr&eacute;cis&eacute;ment le th&egrave;me abord&eacute; dans le corps de votre message.</li>
   <li>Respecter les r&egrave;gles de la courtoisie et de la bonne conduite.</li>
   <li>Ne pas vous livrer &agrave; tout fait qui peut &ecirc;tre puni p&eacute;nalement&nbsp;:</li>
      <ul>
         <li>rev&ecirc;tant un caract&egrave;re pornographique, p&eacute;dophile ou zoophile&nbsp;;</li>
         <li>mena&ccedil;ant une ou plusieurs personnes&nbsp;;</li>
         <li>proposant ou incitant au piratage informatique&nbsp;;</li>
         <li>s'av&eacute;rant calomnieux, diffamatoire, injurieux, raciste&nbsp;ou insitant &agrave; l'&ecirc;tre;</li>
         <li>comportant de la propagande anticonstitutionnelle.</li>
      </ul>
   <li>Respecter les lois en vigueur, notamment en mati&egrave;re de contrefa&ccedil;on.</li>
   <li>Vous exprimer en langue fran&ccedil;aise.</li>
   <li>Faire un effort certain sur l'orthographe de fa&ccedil;on &agrave; faciliter la lecture aux autres membres.</li>
</ul>
</p>
<h3>MODERATION</h3>
<p>Les mod&eacute;rateurs de ce site ayant choisi de faire confiance aux membres, la mod&eacute;ration se fait &agrave; posteriori. Les messages sont donc post&eacute;s directement, sans intervention pr&eacute;alable des mod&eacute;rateurs ou administrateurs. Ceci permet de raccourcir les d&eacute;lais de r&eacute;ponse &agrave; un probl&egrave;me pos&eacute; et de fluidifier l'activit&eacute;.<br />
Les mod&eacute;rateurs sont des membres assidus et consciencieux, choisis pour leur s&eacute;rieux par les administrateurs du site.<ul>
<li>Tout message n'&eacute;tant pas en ad&eacute;quation avec le sujet est susceptible d'&ecirc;tre d&eacute;plac&eacute; ou effac&eacute; sans pr&eacute;avis.</li></ul>
Il est possible, pour les utilisateurs de demander la mod&eacute;ration d'un sujet ou d'un message en envoyant un message priv&eacute; contenant l'adresse URL du message en question aux mod&eacute;rateurs ou administrateurs.<br />
Apr&egrave;s la notification d'un abus, les mod&eacute;rateurs et administrateurs essayeront, tant que faire se peut, de r&eacute;agir dans le d&eacute;lai le plus court possible afin d'y mettre un terme.<br />
En cas d'abus manifeste et grave portant atteinte au site (publication intensive, spam, faits &agrave; l'encontre de la loi), l'auteur pourra &ecirc;tre, sans pr&eacute;avis, banni du site tant qu'il n'aura pas donn&eacute; une explication cr&eacute;dible &agrave; son geste.</p>
<h3>MODIFICATION ET SUPPRESSION D'UN MESSAGE</h3>
<p>Un message post&eacute; dans les forums peut &ecirc;tre supprim&eacute; &agrave; tout moment par son auteur.<br />
En bas de chaque message se trouve une ic&ocirc;ne &agrave; cet effet (Editer/Supprimer les messages post&eacute;s).<br />
Les mod&eacute;rateurs ont &eacute;galement la possibilit&eacute; de le faire s'ils jugent le message non conforme aux r&egrave;gles &eacute;nonc&eacute;es ci-dessus.</p>
<h3>RESPONSABILITE DES AUTEURS DE MESSAGES</h3>
<p>Les messages post&eacute;s le sont sous la responsabilit&eacute; de leurs auteurs qui restent propri&eacute;taires de leurs publications et les repr&eacute;sentants du site d&eacute;clinent toute responsabilit&eacute; dans le contenu de ces messages.<br />
Les auteurs s'engagent &agrave; assumer toutes leurs responsabilit&eacute; et les cons&eacute;quences s'y aff&eacute;rent.</p>
<h3>IDENTIFICATION DES AUTEURS DE MESSAGES</h3>
<p>Les gestionnaires de sites &eacute;tant tenus par la loi de conserver les donn&eacute;es permettant l'identification de l'auteur d'un message, ces informations seront donc conserv&eacute;es par le serveur. Les donn&eacute;es comprennent la date et l'heure de la publication du message ainsi que l'adresse IP et le nom de l'auteur (si membre) du message.<br />
En cas d'infraction manifeste commise par l'interm&eacute;diaire d'un message non censur&eacute; par les mod&eacute;rateurs, les webmasters du site seront tenus de d&eacute;livrer ces informations aux autorit&eacute;s judiciaires ou administratives qui en feraient la demande.</p>
<h3>REFERENCEMENT</h3>
<p>Les messages post&eacute;s dans le site sont susceptibles d'&ecirc;tre r&eacute;f&eacute;renc&eacute;s et index&eacute;s par certains moteurs de recherche.<br />
Il donc possible que les moteurs proc&egrave;dent &agrave; un archivage de ceux-ci en vue de faciliter les recherches dans leurs bases de donn&eacute;es respectives.<br />
Lorsqu'un message mod&eacute;r&eacute; est effac&eacute; du site, il peut rester encore quelques temps dans le cache d'un moteur de recherche sans que les administrateurs ou mod&eacute;rateurs du site ne puissent le purger.<br />
Les responsables du site d&eacute;clinent l&agrave; aussi toute responsabilit&eacute; puisqu'ils ont fait le n&eacute;cessaire, &agrave; leur niveau, pour &eacute;radiquer ce message du r&eacute;seau Internet.</p>
<h3>DROIT D'ACCES</h3>
<p>Conform&eacute;ment au chapitre V de la loi "Informatique et Libert&eacute;s" du 6 janvier 1978, vous disposez d'un droit d'acc&egrave;s &agrave; vos informations personnelles, que vous pouvez modifier par l'interm&eacute;diaire de la page "Votre Compte" accessible en cliquant sur votre pseudo en haut de chaque page.<br />
Si vous souhaitez vous d&eacute;sinscrire, vous pouvez contacter les webmasters par E-mail qui le feront dans les plus brefs d&eacute;lais.<br />
Le site a fait l'objet d'une d&eacute;claration &agrave; la CNIL.</p>