<!DOCTYPE html>
<html lang="fr">
   <head>
      <meta charset="utf-8" />
      <title>Administration - Accueil</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
            <ol class="breadcrumb bg-transparent">
               <li><a href="admin.html"><img class="me-3 ms-n3" width="32px" height="32px" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></a></li>
               <li class="breadcrumb-item active" aria-current="page">Administration</li>
               <li class="breadcrumb-item"> <a href="men_gen.html">Menu</a></li> 
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3 class="mb-3">Administration - Accueil</h3>

         <h4>Introduction</h4>
         <p>NPDS est un gén&eacute;rateur de portail Fran&ccedil;ais en Open-Source sous licence gratuite GNU-GPL utilisant les technologies PHP et MySql qui poss&egrave;de un dispositif multi-langues param&eacute;trable dans les pr&eacute;f&eacute;rences. Par d&eacute;faut, le portail est en fran&ccedil;ais.</p>
         <p>Le contenu, l'interface de cette page dépend bien entendu des droits que vous disposez en tant qu'administrateur (le super administrateur aura donc accès à toutes les fonctions interfacées). L'interface générale est divisée en 3 blocs principaux</p>

         <h4>Les alertes et notifications</h4>
         <p>Le premier bloc rassemble les alertes/notifications vous permettant de traiter les tâches administrateur en attente. (articles propos&eacute;s, articles programm&eacute;s, utilisateurs en attente de validation, nouveau liens, liens rompus etc ...)</p>

         <h4>Les fonctions</h4>
         <p>Pour g&eacute;rer NPDS, vous avez acc&egrave;s &agrave; de nombreux boutons qui sont rassembl&eacute;s par rang&eacute;e en fonction d'une classification par type. Ils se pr&eacute;sentent sous forme d'ic&ocirc;nes ou de texte en fonctions du param&eacute;trage de l'interface graphique d&eacute;fini dans les pr&eacute;f&eacute;rences.</p>
         <div class="card card-body mb-2">
            <ul class="pl-3">
               <li>Les boutons de la premi&egrave;re rang&eacute;e vous permettent de g&eacute;rer le <b>contenu</b> de votre site, une fois que vous avez cliqu&eacute; sur un bouton il vous faut cliquer sur le bouton manuel en ligne pour obtenir la documentation en rapport avec la fonction ouverte.</li>
               <li>La deuxi&egrave;me rang&eacute;e vous permet de g&eacute;rer les <b>utilisateurs</b> du portail</li>
               <li>La troisi&egrave;me rang&eacute;e vous permet de g&eacute;rer tout ce qui concerne la <b>communication</b></li>
               <li>La quatrième rang&eacute;e vous permet de g&eacute;rer l'interface des <b>blocs</b></li>
               <li>La cinquième rang&eacute;e vous permet d'agir sur le <b>système</b>, le lien pr&eacute;f&eacute;rences est un des liens les plus importants. A noter le lien qui vous permet d'installer un module et de savoir les modules qui sont d&eacute;jà install&eacute;s ou non.</li>
               <li>Enfin la dernière rang&eacute;e qui vous permet de g&eacute;rer les <b>modules</b> dot&eacute;s d'une administration.</li>
            </ul>
         </div>

         <h4 class="my-3">Les x derniers articles</h4>
         <div class="card card-body mb-2">
            <ul class="pl-3">
               <li class="card-text">Affiche la liste des x derniers articles publi&eacute;s sur votre site</li>
               <li>Le premier enregistrement est le dernier article publi&eacute;</li>
               <li>Certains articles peuvent &ecirc;tre indiqu&eacute;s en <em>archive</em>, ce sont les articles ayant d&eacute;pass&eacute;s leur date de fin de publication.</li>
               <li>Pour remettre ces articles dans le flux, il suffit de les &eacute;diter, de cliquer sur l'option 'changer la date' et de modifier leur date de fin de publication.</li>
               <li>Cliquez sur l'article pour le voir ou utilisez les liens <em>Editer</em><i class="fas fa-edit fa-lg ms-2 text-primary"></i>, <em>Effacer</em><i class="fas fa-trash fa-lg ms-2 text-danger"></i>.</li>
               <li>Si vous voulez Editer/Effacer un ancien article, saisissez son ID et s&eacute;lectionnez l'action appropri&eacute;e.</li>
            </ul>
         </div>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Manuel administration</span></p>
      </div>
   </body>
</html>