<!DOCTYPE html>
<html lang="fr">
   <head>
      <meta charset="utf-8" />
      <title>Administration - Pr&eacute;f&eacute;rences</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
               <ol class="breadcrumb bg-transparent">
                  <li><a href="admin.html"><img class="me-3 ms-n3" width="32px" height="32px" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></a></li>
                  <li class="breadcrumb-item">&nbsp;<a href="men_gen.html">Menu</a></li>
                  <li class="breadcrumb-item"><a href="men_syst.html">Syst&egrave;me</a></li>
                  <li class="breadcrumb-item active" aria-current="page" >Pr&eacute;f&eacute;rences</li>
               </ol>
         </nav>
         <hr class="mt-n3" />
         <h3 class="mb-3">Administration - Pr&eacute;f&eacute;rences</h3>
         <p>Cette fonction est la plus importante quand vous d&eacute;marrez un site avec NPDS. Vous pouvez modifier toutes les informations importantes de votre site et surtout lui donner le look et le feeling que vous souhaitez.<br />
         Vous trouverez ci-dessous une explication pour les param&egrave;tre importants de NPDS.</p>

         <h4>Informations g&eacute;n&eacute;rales du site</h4> 
         <h5>Parse algo</h5>
         <p>Pour les pr&eacute;f&eacute;rences de votre site, vous pouvez choisir l'une ou l'autre des fonctions de Parse.
            <ul>
               <li>FixQuotes est la fonction d'origine qui double les ['] (ex : l'art devient l''art)</li>
               <li>StripSlashes permet de ne pas toucher au texte (ex : l'art reste l'art) mais peut poser d'autres probl&egrave;mes.</li>
            </ul>
         </p>
         <h5>OB_Gzhandler</h5>
         <p>Permet l'utilisation  de l'envoi de donn&eacute;es compress&eacute;es aux navigateurs qui supportent les pages compress&eacute;es.<br />
         Avant que ob_gzhandler() envoie les donn&eacute;es compress&eacute;es, il d&eacute;termine les types d'encodage qui sont support&eacute;s par le navigateur ("gzip", "deflate" ou aucun) et retourne le contenu des buffers de mani&egrave;re appropri&eacute;e. Tous les navigateurs sont trait&eacute;s, car c'est aux navigateurs d'envoyer une en-t&ecirc;te indiquant les types de pages support&eacute;s.<br />
         <span class="text-danger"><strong>Ne fonctionne qu'avec la Zlib active (faire un phpinfo();) et pour Apache, le mod_gzip activ&eacute;.</strong></span></p>
         <h5>FileManager</h5>
         <p>Active ou retire l'acc&egrave;s au FileManager. Attention n'activez le FileManager que lorsque que vous en avez besoin.</p>
         <h5>Dur&eacute;e de vie des cookies admin et user</h5>
         <p>Sans commentaires (1 an = 8760 heures)</p>
         <h5>Nom du site</h5>
         <p>Votre site a un nom, alors c'est ici qu'il faut le saisir.</p>
         <h5>Nom du site pour la balise Title</h5>
         <p>Titre des pages HTML de votre site (notamment pour les moteurs de recherche)</p>
         <h5>URL du site</h5>
         <p>http://www.xxx.com ou http://www.xxx.xom/~homepage/...</p>
         <h5>Logo du site</h5>
         <p>fichier .gif ou .jpg localis&eacute; dans le r&eacute;pertoire <b>images</b> de votre serveur(par d&eacute;faut) ou dans un de vos th&egrave;mes (chemin complet : themes/mon_theme/..../logo.jpg par exemple).<br />
         Ce fichier ne sert que dans les fonctions d'impression de NPDS. Une bonne chose est de faire une image en noir et blanc.</p>
         <h5>Slogan du site</h5>
         <p>Si votre site a un slogan, alors c'est ici qu'il faut le saisir.</p>
         <h5>Date de d&eacute;marrage du site</h5>
         <p>Une date (20/01/2016 ou 31 Janvier 2016) qui ne sera visible que dans les statistiques.</p>
         <h5>Nombre d'&eacute;l&eacute;ments dans la page top x</h5>
         <p>Permet de param&egrave;trer le top x (5, 10, 15, ...).</p>
         <h5>Nombre d'articles en page principale</h5>
         <p>Combien d'articles sur une seule page ?<br />
         Un chiffre correct est 10 mais cela d&eacute;pend de l'activit&eacute; de votre site. Rappelez-vous que les membres enregistr&eacute;s dans NPDS peuvent changer cette valeur, donc ce param&egrave;tre n'est qu'une valeur par d&eacute;faut.</p>
         <h5>Nombre d'articles dans la boite des anciens articles</h5>
         <p>Dans les blocs de droite, se trouve celui qui montre une liste d'anciens articles. C'est ce nombre que vous param&egrave;trez ici.</p>
         <h5>Activer Export-News</h5>
         <p>Export-News sont deux fichiers texte localis&eacute;s dans le r&eacute;pertoire cache de votre site. Par d&eacute;faut ce param&egrave;tre = non.<br />
         Dans ces deux fichiers (ultramode.txt et net2zone.txt) sont contenus les 10 derni&egrave;res news de votre site.<br />
         Ce fichier permet en fait &agrave; d'autres sites de former des canaux d'informations en se basant sur des structures simples :
            <ul>
               <li>ultramode.txt est un fichier texte ou les news sont s&eacute;par&eacute;es par des %%</li>
               <li>net2zone.txt est un fichier texte au format XML de net2zone.<br />
               La fonction "Online" r&eacute;alisant la m&ecirc;me op&eacute;ration est <i>Backend</i> qui supporte le format RDF/XML ou mieux encore le module NPDS Push Infos System.</li>
            </ul>
         </p>
         <h5>Nom par d&eacute;faut de anonyme</h5>
         <p>Nom par d&eacute;faut des utilisateurs <b>non</b> enregistr&eacute;s. Anonyme est une bonne valeur (mais aussi invit&eacute;, visiteur...).<br />
         Ne changez pas cette valeur en cours de fonctionnement de NPDS.</p>
         <h5>Autoriser la cr&eacute;ation de "news"</h5>
         <p>Permet de restreindre (ou non) la soumission de news aux mod&eacute;rateurs / administrateurs ou membres.<br />
         Cette fonction est int&eacute;ressante pour un site d'informations.</p>
         <h5>Ne pas enregistrer les 'hits' des auteurs dans les statistiques</h5>
         <p>Permet de ne pas compter la maintenance de votre site, comme de visiteurs r&eacute;els.</p>
         <h5>Th&egrave;me d'affichage par d&eacute;faut du site</h5>
         <p>S&eacute;lectionnez le th&egrave;me par d&eacute;faut de votre site. Rappelez-vous que les utilisateurs enregistr&eacute;s peuvent modifier cette option &agrave; condition de mettre plusieurs th&egrave;mes &agrave; disposition.</p>
         <h5>Page de d&eacute;marrage</h5>
         <p>Cette fonction permet de param&egrave;trer la page de d&eacute;marrage (l'accueil) de votre site, par d&eacute;faut la page est index.php (le syst&egrave;me d'affichage des articles) mais vous pouvez choisir une autre fonction :
            <ul>
               <li>links.php</li>
               <li>faqs.php</li>
               <li>static.php?op=npds.txt&<b>npds</b>=1 ... (la valeur de npds peut-&ecirc;tre -1 : sans blocs, 0 : bloc gauche, 1 : blocs gauche et droite)</li>
               <li>Edito :
                  <ul>
                     <li>index.php?op=<b>edito</b><br />
                     affichage de l'&eacute;dito <b>et</b> du syst&egrave;me de News (sans le lien page suivante en bas des news)</li>
                     <li>index.php?op=<b>edito-nonews</b><br />
                     affichage de l'&eacute;dito <b>sans</b> le syst&egrave;me de News</li>
                     <li>index.php?op=<b>newindex</b><br />
                     <li>affichage du syst&egrave;me de News <b>sans</b> l'&eacute;dito (avec le lien page suivante en bas des news)</li>
                     <li>index.php?op=<b>edito-newindex</b><br />
                     affichage de l'&eacute;dito <b>avec</b> le syst&egrave;me de news (avec le lien page suivante en bas des news)</li>
                     <li>index.php?op=<b>newtopic&topic=X</b> : affichage du syst&egrave;me de News relatif au sujet d'id X <b>sans</b> l'&eacute;dito (avec le lien page suivante en bas des news)</li>
                  </ul>
               </li>
            </ul>
         </p>
         <h5>S&eacute;lectionner la langue du site</h5>
         <p>Sans commentaires.</p>
         <h5>Activer le Multi-Langue</h5>
         <p>Permet &agrave; NPDS de g&eacute;rer plusieurs langues via les tags [langue]...[/langue].<br />Pensez &agrave; param&egrave;trer aussi Heure Locale (par exemple : [french]fr_FR[/french][english]en_EN[/english]).</p>
         <h5>Heure locale</h5>
         <p>Pour un site sous windows, la valeur doit &ecirc;tre = french / Sinon ce champ d&eacute;pend des fonctions "locales" normalement install&eacute;es sous /usr/share/locale (pour unix).</p>
         <h5>Le jour commence &agrave; et la nuit commence &agrave;</h5>
         <p>Permet de r&eacute;gler par exemple, le changement d'&eacute;dito &agrave; partir d'une certaine heure.</p>
         <h5>UTC</h5>
         <p>Permet de sp&eacute;cifier (en + ou -) un d&eacute;calage horaire par rapport &agrave; celui de la machine d'h&eacute;bergement.</p>

         <h4>Options pour les banni&egrave;res</h4>
         <h5>Activer les banni&egrave;res sur le site</h5>
         <p>Oui ou Non voulez-vous activer les banni&egrave;res de publicit&eacute;. Cela n&eacute;cessite quand m&ecirc;me que vous ayez
         param&egrave;tr&eacute; une campagne ...</p>
         <h5>Votre adresse IP pour ne pas comptabiliser les hits qui en proviennent</h5>
         <p>Soyez honn&ecirc;te, car si vous &ecirc;tes administrateur de ce site, votre poste (et donc son adresse IP) doit-&ecirc;tre exclue pour ne pas "bricoler" les compteurs.</p>

         <h4>Messages de pied de page</h4>
         <h5>Ligne 1,2,3,4</h5>
         <p>Pied de page de votre site, ces zones supportent les codes HTML. Si vous n'avez besoin que d'une ou 2 lignes, laissez les zones vides (en partant de la fin).<br />
         En g&eacute;n&eacute;ral on trouve les informations de copyright, de cr&eacute;dits, le nom de l'h&eacute;bergeur...</p>

         <h4>Configuration des infos en Backend</h4>
         <p class="text-body-secondary">canaux d'informations au format RDF/XML</p>
         <h5>Titre du Backend</h5>
         <p>Sans commentaires. Vous pouvez mettre votre slogan apr&egrave;s le Titre.</p>
         <h5> Langue du Backend</h5>
         <p>le m&ecirc;me format que pour la langue du site.</p>
         <h5> URL de l'image du Backend</h5>
         <p>Le chemin complet (http://...) permettant l'acc&egrave;s &agrave; une image/logo de votre site.</p>
         <h5>Largeur de l'image du Backend</h5>
         <p>Sans commentaires.</p>
         <h5>Hauteur de l'image du Backend</h5>
         <p>Sans commentaires.</p>

         <h4>Configuration par d&eacute;faut des liens web</h4>
         <h5>Nombre de liens par page</h5>
         <p>Le nombre maximun de liens par page (dans la fonction liens web).</p>
         <h5>D&eacute;finit le nombre de hits sur le lien pour qu'il soit populaire</h5>
         <p>Sans commentaires. Affiche une petite &eacute;toile &agrave; droite du lien lorsque ce crit&egrave;re est rempli.</p>
         <h5>Nombre de liens 'Nouveau'</h5>
         <p>D&eacute;finit le nombre maximun de liens dans la page "Nouveau".</p>
         <h5>Nombre de liens 'Meilleur'</h5>
         <p>D&eacute;finit le nombre maximun de liens dans la page "Populaire" (les liens les plus "cliqu&eacute;s").</p>
         <h5>Nombre de liens dans les r&eacute;sultats des recherches</h5>
         <p>Sans commentaires.</p>
         <h5>Laisser les utilisateurs anonymes poster de nouveaux liens</h5>
         <p>Oui ou non</p>
         <h5>Afficher le logo sur la page web links</h5>
         <p>Oui ou non. Le logo prenant de la place...</p>
         <h5>Activer l'ic&ocirc;ne [N]ouveau pour les cat&eacute;gories</h5>
         <p>Affiche un petit symbole, lorsqu'une cat&eacute;gorie est nouvelle ou s'il y a de nouveaux liens.</p>

         <h4>Syst&egrave;me de messagerie (Email)</h4>
         <h5>Adresse m&eacute;l de l'administrateur</h5>
         <p>Sert lorsque NPDS envoie des m&eacute;ls automatiquement et permet donc au destinataire de vous r&eacute;pondre (Adresse E-mail valide, autoris&eacute;e et associ&eacute;e au serveur d'envoi. => ex : developpeur@npds.org).</p>
         <h5>Quelle protocole mail utiliser ?</h5>
         <p>Utiliser ou pas le protocole SMTP(S)</p>
         <h6>Configuration de PHPmailer SMTP(S)</h6>
         <p>
            <ul>
               <li>Le nom du serveur d'envoi</li>
               <li>Port TCP qui doit être utilisé. 587 ou 465 (plus rare et obsolète) si vous utiliser le chiffrement SMTPS. Pour SMTP parfois les ports 25 ou 2525</li>
               <li>Authentification : si elle est requise par votre serveur alors renseigner : le nom d'utilisateur et le mot de passe.</li>
               <li>Activer ou non le chiffrement de vos messages durant les transfert. Et choississer le protocole de chiffrement TLS (défaut) ou SSL (obsolète). A noter Que SMTP ne crytpte les messages que lors de leurs transferts.</li>
            </ul>
         </p>
         <h6>DKIM</h6>
         <p>Utiliser l'enregistrement DKIM du DNS ou un enregistrement DKIM généré automatiquement par le portail</p>
         <h5>Pied de m&eacute;l</h5>
         <p>NPDS envoie un certain nombre de m&eacute;ls (mot de passe, ...) et cette option vous permet de param&egrave;trer le "pied" (la fin, la signature) de ces m&eacute;ls. Cette zone supporte les codes HTML. Une bonne habitude est le rappel de vos coordonn&eacute;es, votre slogan.</p>
         <p>Envoyer par m&eacute;l les nouveaux articles &agrave; l'administrateur. NPDS permet d'avertir un administrateur chaque fois qu'un utilisateur poste un nouvel article.</p>
         <h5>Notifier les nouvelles contributions par m&eacute;l</h5>
         <p>Oui ou non.</p>
         <h5>Adresse E-mail o&ugrave; envoyer le message</h5>
         <p>Sans commentaires.</p>
         <h5>Sujet du m&eacute;l</h5>
         <p>Sans commentaires.</p>
         <h5>Message du m&eacute;l</h5>
         <p>Sans commentaires.</p>
         <h5>Adresse E-mail (Provenance)</h5>
         <p>Sans commentaires.</p>

         <h4>Mod&eacute;ration des commentaires</h4>
         <h5>Type de mod&eacute;ration</h5>
         <p>Le syst&egrave;me de mod&eacute;ration marche mais ne lui faites pas une confiance aveugle.
            <ul>
               <li>Mod&eacute;ration par l'administrateur</li>
               <li>Mod&eacute;ration par les utilisateurs</li>
               <li>Pas de mod&eacute;ration</li>
            </ul>
         </p>
         <h5>Autoriser les commentaires anonymes</h5>
         <p>Si vous voulez que les utilisateurs anonymes (c.a.d non enregistr&eacute;s) puissent publier des commentaires, s&eacute;lectionnez oui.</p>
         <h5>Nombre maximum de Commentaires par utilisateur en 24H</h5>
         <p>Pour anonyme et les membres, limite le nombre de commentaires des articles et des sondages. 6 par d&eacute;faut, 99999 au maximum.</p>

         <h4>Options des sondages</h4>
         <h5>Nombre maximum de choix pour les sondages</h5>
         <p>Sans commentaires.</p>
         <h5>Autoriser les utilisateurs &agrave; voter plusieurs fois</h5>
         <p>Oui ou non, cela d&eacute;pend de vous. Si vous utilisez oui, cela indiquera &agrave; NPDS d'autoriser un utilisateur &agrave; voter toutes les 24 heures et d'afficher un petit message dans les sondages. Dans le cas contraire, le vote est unique pour toute la dur&eacute;e du sondage.</p>
         <h5>Activer les commentaires des sondages</h5>
         <p>Sans commentaires.</p>

         <h4>Quelques r&eacute;glages d'ordre graphique</h4>
         <p>Ne changez pas cette option sauf si...</p>
         <h5>Chemin des images des sujets</h5>
         <p>Normalement /images/topics.</p>
         <h5>Chemin de certaines images (vote...)</h5>
         <p>Normalement /images/menu/.</p>
         <h5>Chemin des images du menu administrateur</h5>
         <p>Normalement images/admin/.</p>
         <h5>Activer les images dans le menu administration</h5>
         <p>Oui ou non. Non vous permettra de gagner du temps.</p>
         <h5> Activer les menus courts pour l'administration</h5>
         <p>Oui ou non. oui vous permettra de gagner du temps.</p>

         <h4>Divers</h4>
         <h5>Nombres d'articles en mode administration</h5>
         <p>Sans commentaires (mais cette valeur est utilis&eacute;e aussi pour les rubriques...).</p>
         <h5>Longueur minimum des mots de passe utilisateurs</h5>
         <p>8 est une bonne valeur.</p>
         <h5>Nombre d'utilisateur "list&eacute;"</h5>
         <p>Dans l'annuaire avant que de passer &agrave; la page suivante.</p>
         <h5>Activer les avatars</h5>
         <p>NPDS permet de ne pas utiliser les avatars (petite image) pour la cr&eacute;ation des membres, les forums... .</p>
         <h5>Taille maximum des avatars personnels (largeur * hauteur / 60*80) en pixel</h5>
         <p>NPDS permet de sp&eacute;cifier la taille maximum des avatars t&eacute;l&eacute;charg&eacute;ables.</p>
         <h5>Activer la description courte des utilisateurs</h5>
         <p>NPDS permet de ne pas demander &agrave; un nouvel utilisateur la saisie de ses adresses ICQ, MSN...</p>
         <h5>Autoriser la cr&eacute;ation automatique des membres</h5>
         <p>NPDS permet de ne pas autoriser un nouveau membre &agrave; se connecter sans une intervention de l'administrateur (valeur : autoriser la connexion de la fiche utilisateur). Pratique pour les portails "ferm&eacute;s".</p>
         <h5>Autoriser les utilisateurs &agrave; choisir leur mot de passe</h5>
         <p>Vous pouvez autoriser un nouvel utilisateur &agrave; choisir le mot de passe qu'il souhaite utiliser. Vous pouvez aussi coupler cette option &agrave; la pr&eacute;c&eacute;dente pour &eacute;viter de laisser faire vos nouveaux membres.</p>
         <h5>Autoriser les abonnements</h5>
         <p>Autoriser vos membres &agrave; s'abonner aux diff&eacute;rentes sources d'infos de NPDS (Sujets, Forums, messages internes...) et donc &agrave; recevoir un m&eacute;l d'information (attention cela peut g&eacute;n&egrave;rer une charge importante).</p>
         <h5>Autoriser les membres invisibles</h5>
         <p>Autoriser vos membres &agrave; devenir 'invisible', ils ne seront pas affich&eacute;s dans les diff&eacute;rents modules de NPDS (sauf pour les administrateurs).</p>
         <h5>Fermer les nouvelles inscriptions</h5>
         <p>NPDS permet de fermer temporairement l'inscription des nouveaux membres (la page static/closed.txt est affich&eacute;e).</p>
         <h5>Activer les r&eacute;f&eacute;rants HTTP</h5>
         <p>Sans commentaires.</p>
         <h5>Combien de r&eacute;f&eacute;rants au maximum</h5>
         <p>Ne chargez pas trop votre base de donn&eacute;es.</p>
         <h5>Liste des membres : priv&eacute;</h5>
         <p>NPDS permet de n'afficher l'annuaire qu'aux membres.</p>
         <h5>Rubrique de t&eacute;l&eacute;chargement</h5>
         <p>Choississez la rubrique (cat&eacute;gorie) des t&eacute;l&eacute;chargements qui sera affich&eacute;e en premier ou aucune.</p>
         <h5>Critiques courtes</h5>
         <p>Transformez les critiques en livre d'or.</p>

         <h4>Divers http</h4>
         <h5>Activer pour les grands titres de sites de news, la v&eacute;rification de l'existance d'un web sur le port 80</h5>
         <p>NPDS permet de ne pas demander la v&eacute;rification de l'existance d'un web sur le port 80. Pratique pour Multimania et autres ISP.</p>
         <h5>Activer pour les pages HTML g&eacute;n&eacute;r&eacute;es, les tags avanc&eacute;s de gestion du cache</h5>
         <p>NPDS permet d'utiliser les fonctions avanc&eacute;es de gestion du cache des pages HTML, certains ISP ne l'autorisent pas (comme Multimania).</p>
         <h5>Activer la r&eacute;solution DNS pour les Posts (forums...)</h5>
         <p>NPDS permet de 'capturer' en m&ecirc;me temps que l'adresse IP, le nom DNS. Attention cette option peut-&ecirc;tre consommatrice de CPU sur le serveur (ou m&ecirc;me interdite).</p>

         <h4>Divers system</h4>
         <h5>Taille maximum des fichiers de sauvegarde SaveMysql</h5>
         <p>Taille des fichiers de dump ASCII avant la compression.</p>
         <h5>Type de sauvegarde SaveMysql</h5>
         <p>Type de r&eacute;sultat souhait&eacute; lors de la sauvegarde.</p>
         <h5>Activer l'&eacute;diteur Tiny-Mce</h5>
         <p>NPDS peut utiliser Tiny-Mce (compatible IE, Firefox, ...).</p>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Manuel administration</span></p>
      </div>
   </body>
</html>