<!DOCTYPE html>
<html lang="fr">
<head>
   <meta charset="utf-8" />
      <title>Administration - T&eacute;l&eacute;chargement</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
            <ol class="breadcrumb bg-transparent">
               <li><a href="admin.html"><img class="me-3 ms-n3" width="32px" height="32px" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></a></li>
               <li class="breadcrumb-item"> <a href="men_gen.html">Menu</a></li>
               <li class="breadcrumb-item"><a href="men_contenu.html">Contenu</a></li>
               <li class="breadcrumb-item active" aria-current="page" >Downloads</li>
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3 class="mb-3">Administration - T&eacute;l&eacute;chargement</h3>
         <p>Cette fonction vous permet d'administrer l'application "T&eacute;l&eacute;chargement" de votre site. Cette fonction &eacute;tant souvent utilis&eacute;e, portez une attention particuli&egrave;re aux &eacute;l&eacute;ments saisis.</p>
         <p>Une liste des fichiers actuellement disponibles en t&eacute;l&eacute;chargement est affich&eacute;e avec l'ensemble des informations disponibles (num&eacute;ro, compteur, url de chargement, nom du fichier, ...) ainsi que les liens permettant la modification et/ou la suppression du fichier.</p>

         <h4>Editer un T&eacute;l&eacute;chargement</h4>
         <p>Cliquez sur le lien <i>Editer</i> pour pouvoir afficher et modifier les informations du t&eacute;l&eacute;chargement. Pour finir cliquez sur le bouton <i>Sauver</i>.<br />
         Vous pouvez changer la date (actualisation) et changer les privil&egrave;ges sur cet &eacute;cran.<br />
         V&eacute;rifiez votre syntaxe ainsi que l'URL de chargement !</p>

         <h4>Supprimer un fichier</h4>
         <p>Cliquez sur le lien <i>Effacer</i> du t&eacute;l&eacute;chargment que vous souhaitez supprimer. Un message de confirmation vous demande de valider votre requ&ecirc;te.</p>
         <h4>Ajouter un T&eacute;l&eacute;chargement</h4>
         <p>
            <ul>
               <li>Saisissez l'URL (externe ou interne &agrave; votre site) ou cliquez sur Parcourir.<br />
               Parcourir permet de naviguer dans votre site dans une nouvelle fen&egrave;tre et 'Copier' met directement &agrave; jour le formulaire !</li>
               <li>Le compteur peut-&ecirc;tre initialis&eacute; avec une valeur (n'&eacute;xag&eacute;rez pas ...).</li>
               <li>Pour que NPDS calcule automatiquement la taille du fichier, ne mettez rien dans le champ "taille du fichier"</li>
               <li>Version, taille, lien vers la page Web du propri&eacute;taire, nom du propri&eacute;taire sont des champs facultatifs.</li>
               <li>Cat&eacute;gorie, description et privil&egrave;ges sont des champs obligatoires.</li>
            </ul>
         </p>
         <p>
            <strong>Nota bene :</strong>
            <ul>
               <li>Pour ajouter une cat&eacute;gorie, saisissez simplement un nouveau terme dans le champ.</li>
               <li>Attention aux privil&egrave;ges, Anonyme permet un t&eacute;l&eacute;chargement par n'importe quel utilisateur.</li>
            </ul>
         </p>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Manuel administration</span></p>
      </div>
   </body>
</html>
