<!DOCTYPE html>
<html lang="fr">
   <head>
      <meta charset="utf-8" />
      <title>Administration - Configuration Forums</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
            <ol class="breadcrumb bg-transparent">
               <li><a href="admin.html"><img class="me-3 ms-n3" width="32px" height="32px" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></a></li>
               <li class="breadcrumb-item"><a href="men_gen.html">Menu</a></li>
               <li class="breadcrumb-item"><a href="men_com.html">Communication</a></li>
               <li class="breadcrumb-item active" aria-current="page" >Configuration Forums</li>
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3 class="mb-3">Administration - Configuration Forums</h3>

         <h4>Autoriser le HTML</h4>
         <p>Autorise ou interdit (supprime) l'interpr&eacute;tation des tags HTML.</p>

         <h4>Autoriser Smilies</h4>
         <p>Autorise l'insertion de Smilies dans les Forums.</p>

         <h4>Autoriser les Signatures</h4>
         <p>Permet d'autoriser l'utilisation des signatures pour les membres dans les publications des forums.</p>

         <h4>Seuil pour les sujet 'chauds'</h4>
         <p>Permet de d&eacute;finir le seuil au-dessus duquel un sujet est consid&eacute;r&eacute; comme "chaud".</p>

         <h4>Nombre de contributions par page</h4>
         <p>C'est le nombre de contributions par sujet qui sera pr&eacute;sent&eacute; par page pour un seul et m&ecirc;me sujet.</p>

         <h4>Sujets par forum</h4>
         <p>C'est le nombre de sujets par forum qui sera activ&eacute; pour un seul et m&ecirc;me forum.</p>

         <h4>Activer le tri des contributions 'r&eacute;solues'</h4>
         <p>Active le tri et l'affichage du lien [ (Seulement / Sans) R&eacute;solu ].</p>

         <h4>Nombre maximum de contributions par IP et par p&eacute;riode de 30 minutes</h4>
         <p>(0=syst&egrave;me inactif)<br />
         Cette option vous permet de sp&eacute;cifier le nombre maximum de post qu'une m&ecirc;me adresse IP OU un m&ecirc;me membre peut poster pendant :
            <ul>
               <li>une premi&egrave;re p&eacute;riode de 30 minutes</li>
               <li>une deuxi&egrave;me p&eacute;riode de 90 minutes (dans ce cas c'est le double de cette valeur qui est utilis&eacute;e)</li>
               <li>0 ou vide revient &agrave; d&eacute;sactiver le syst&egrave;me</li>
            </ul>
         </p>

         <h4>Activer l'upload dans les forums</h4>
         <p>Permet d'activer la possibilit&eacute; de stocker des fichiers directement dans les forums. Ensuite vous pourrez autoriser cette fonction que dans certains de vos forums (voir Administration / Edition des Forums).</p>

         <h4>Activer les textes cach&eacute;s dans les forums</h4>
         <p>Permet d'activer la possibilit&eacute; de cacher une partie du texte d'un post dans les forums en utilisant les balises [hide] Mon texte &agrave; cacher [/hide].</p>

         <h4>Texte pour le r&ocirc;le X</h4>
         <p>Le forum est capable d'afficher un texte sp&eacute;cifique en fonction du r&ocirc;le d'un membre. Les tags Multi-langue sont support&eacute;s dans ces zones.</p>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Manuel administration</span></p>
      </div>
   </body>
</html>