<!DOCTYPE html>
<html lang="fr">
   <head>
      <meta charset="utf-8" />
      <title>Administration - Edition Forums</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3 fw-light">
            <ol class="breadcrumb bg-transparent">
               <li><a href="admin.html"><img class="me-3 ms-n3" width="32px" height="32px" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></a></li>
               <li class="breadcrumb-item">&nbsp;<a href="men_gen.html">Menu</a></li>
               <li class="breadcrumb-item"><a href="men_com.html">Communication</a></li>
               <li class="breadcrumb-item active" aria-current="page" >Edition Forums</li>
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3 class="mb-3">Administration - Edition Forums</h3>
         <p>Cette fonction vous permettra d'assurer la gestion de vos Forums.<br />
         La premi&egrave;re liste affich&eacute;e est en fait la repr&eacute;sentation des cat&eacute;gories et forums actifs sur votre site.</p>

         <h4>Edition des Forums</h4>
         <p>Une deuxi&egrave;me page s'affiche avec la liste des forums pr&eacute;sents dans la cat&eacute;gorie.<br />
         Vous pouvez ajouter un forum :
            <ul>
               <li>Index : de la m&ecirc;me mani&egrave;re que pour les blocs, c'est la possibilit&eacute; de classer vos diff&eacute;rents forums.</li>
               <li>Nom du forum</li>
               <li>Description du forum (ne soyez pas trop long)</li>
               <li>indentifiant du ou des mod&eacute;rateur(s) (obligatoire) : s'il y a plusieurs mod&eacute;rateurs pour un m&ecirc;me forum, s&eacute;parer les noms par des , (virgules).</li>
               <li><b>Niveau d'acc&egrave;s pour la PUBLICATION</b> :
                  <ul>
                     <li>Publication Anonyme autoris&eacute;e</li>
                     <li>Publication Utilisateur enregistr&eacute; uniquement</li>
                     <li>Publication Mod&eacute;rateur uniquement</li>
                     <li>Ferm&eacute; (le forum est ferm&eacute; &agrave; toute nouvelle publication ou modification)</li>
                  </ul>
               <li><b>Type de forum</b> : Public, Priv&eacute;, PHP Script, Texte &eacute;tendu, Groupe ou Cach&eacute;
                  <ul>
                     <li>Public = acc&egrave;s &agrave; tous</li>
                     <li>Priv&eacute; = acc&egrave;s par mot de passe</li>
                     <li>PHP Script=Forum permettant de stocker et d'afficher du code (php, perl, c, ...).<br />
                      Attention certaines choses ne fonctionnent pas avec ce forum (Smilley, ...)</li>
                     <li>Texte &eacute;tendu = Permet d'associer &agrave; un forum, un formulaire SFORM</li>
                     <li>Groupe = Permet d'associer un forum &agrave; N groupes de membre</li>
                     <li>Texte Cach&eacute; = visible que pour les membres</li>
                     <li>Le Champ suivant prend diff&eacute;rentes valeurs :
                        <ul>
                           <li>Mot de Passe (si Forum Priv&eacute;)</li>
                           <li>Le nom du fichier de formulaire (si Forum Texte &eacute;tendu)<br />
                           dans modules/sform/forum (par exemple : formulaire.php)</li>
                           <li>L'identifiant des Groupes de membre (si Forum Groupe) s&eacute;parer les noms par des , (virgules) // exemple : 5,12,56</li>
                        </ul>
                     </li>
                  </ul>
               <li><b>Mode du forum</b> : Standard ou Arbre
                  <ul>
                     <li>Le mode arbre permet une gestion particuli&egrave;re (arborescente) des posts mais peut n&eacute;cessiter une certaine puissance de calcul</li>
                  </ul>
               <li><b>Attachement</b> : Si dans Administration / Configuration des Forums, l'option "Activer l'upload dans les forums" est sur Oui, vous pourrez sp&eacute;cifier si vous autorisez, pour ce forum, les pi&egrave;ces jointes.</li>
            </ul>
         </p>
         <p><b>Pour faire une redirection vers un forum externe</b> (une sorte de lien), saisissez simplement une url dans le Nom du Forum !</p>
         <p><b>Sous-Forum :</b><br />Un forum dont le nom commence par &lt;!&gt; n'apparaitra pas dans la liste. Un meta-mot permet d'obtenir le status de lecture d'un forum : forum_subfolder(numero_du_forum).<br />
         Exemples :
            <ul>
               <li>imaginez un forum dont le num&eacute;ro est 3 et dont le nom est : "&lt;!&gt;Rien que pour NPDS"</li>
               <li>Imaginez dans la zone commentaire du forum 1 un texte comme celui-ci : forum_subfolder(3) &lt;a href="viewforum.php?forum=3"&gt;Rien que pour NPDS&lt;/a&gt;</li>
            </ul>
         </p>
         <p>Vous pouvez &eacute;diter un forum pour le modifier.</p>
         <p>Vous pouvez supprimer un forum (message de confirmation).</p>

         <h4>Ajouter une cat&eacute;gorie</h4>
         <p>Vous permet d'ajouter une cat&eacute;gorie dans laquelle vous pourrez ins&eacute;rer des forums. Cliquez sur Ajouter pour finir.</p>

         <h4>Editer la cat&eacute;gorie</h4>
         <p>Vous permet de modifier la cat&eacute;gorie : son titre ET son ID (ce qui permet de classer les cat&eacute;gories). Cliquez sur Ok pour finir.</p>

         <h4>Effacer la cat&eacute;gorie</h4>
         <p>Cette fonction vous permet de supprimer une cat&eacute;gorie, tous les forums rattach&eacute;s ainsi que toutes les contributions.<br />
         Un message de confirmation est quand m&ecirc;me affich&eacute; ...</p>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Manuel administration</span></p>
      </div>
   </body>
</html>