<!DOCTYPE html>
<html lang="fr">
   <head>
      <meta charset="utf-8" />
      <title>Administration - Mise &agrave; jour</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
            <ol class="breadcrumb bg-transparent">
               <li><a href="admin.html"><img class="me-3 ms-n3" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></a></li>
               <li class="breadcrumb-item"><a href="men_gen.html">Menu</a></li>
               <li class="breadcrumb-item"><a href="men_syst.html">Syst&egrave;me</a></li>
               <li class="breadcrumb-item active" aria-current="page" >Mise &agrave; jour</li>
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3 class="mb-3">Administration - Mise &agrave; jour</h3>
         <p class="lead">
         <br />C'est ici que l'on peut mettre &agrave; jour la version en service de son portail par une version plus r&eacute;cente (ou &eacute;gale) ou par la version de d&eacute;veloppement (master) !...<br />
         Cette mise &agrave; jour s'effectue en deux &eacute;tapes d'abord les fichiers puis la base de donn&eacute;es.</p>
         <h4>Mise &agrave; jour des fichiers</h4>
         <p>L'interface surtout explicatif ne permet en fait que le choix d'un param&egrave;tre : la version qui va remplacer celle en service sur le portail.<br />
        Un premier &eacute;cran pr&eacute;sente : 
            <ul>
               <li>le r&eacute;capitulatif des versions : version en service sur le portail et derni&egrave;re version stable disponible</li>
               <li>un message variable faisant le point</li>
               <li>une liste d&eacute;roulante permettant un choix orient&eacute; de la version pour pr&eacute;parer la mise &agrave; jour</li>
               <li>le bouton <code>Pr&eacute;parer la mise &agrave; jour</code> qui vous permet apr&egrave;s votre choix d'acc&eacute;der au deuxi&egrave;me &eacute;cran</li>
            </ul>
         </p>
         <p>Le deuxi&egrave;me &eacute;cran indique les recommandations pr&eacute;alables et le rappel des options choisies ou impos&eacute;es pour la mise &agrave; jour. Il contient deux boutons :
            <ul>
               <li><code>Retour</code> ==> (retour au premier &eacute;cran) ...</li>
               <li><code>Lancer la mise &agrave; jour</code> ==> d&eacute;clanche une alerte javascript de confirmation (ou pas) et lance la proc&eacute;dure de mise &agrave; jour dans le <b>d&eacute;ployeur</b> ...</li>
            </ul>
         </p>
         <p>Vous voici dans l'interface progressive de contr&ocirc;le et d'informations des process qui durent entre 2 et 3 minutes au total.<br />
         En cas de succ&egrave;s un bouton <code>Acc&eacute;der &agrave; l'administration</code> permet de revenir dans l'administration sur l'&eacute;cran de confirmation de r&eacute;ussite de la mise &agrave; jour des fichiers.</p>
         <h4>Migration base de donn&eacute;es</h4>
         <p>Si tout c'est bien pass&eacute; vous avez maintenant acc&egrave;s au bouton <code>Migrer la base de donn&eacute;es</code> qui d&eacute;clanche une alerte javascript de confirmation (ou pas) et lance la migration de la base de donn&eacute;es.<br />
         <strong>Conseil :</strong> Avant de lancer une mise &agrave; jour, effectuez une sauvegarde compl&egrave;te de votre base de donn&eacute;es via phpMyAdmin ou NPDS <code>/admin.php?op=SavemySQL</code>.<br />
         L'&eacute;cran suivant r&eacute;sume le contexte l'analyse des diff&eacute;rences structurelle et les requ&ecirc;tes g&eacute;n&eacute;r&eacute;es qui vont &ecirc;tre ex&eacute;cut&eacute;es gr&acirc;ce au bouton <code>Executer la migration</code> et modifier la base de donn&eacute;e en service...</p>
         <p>Un dernier &eacute;cran affichera le r&eacute;sultat de la migration de la base de donn&eacute;es et de la mise &agrave; jour dans son ensemble.</p>
         <p>En cas d'&eacute;chec de la migration de la base de donn&eacute;es, un lien vous permettra de relancer la proc&eacute;dure sans perte des param&egrave;tres de mise &agrave; jour.</p>
         <h4>M&eacute;mo technique</h4>
         <p>
         <ul>
            <li>Toute mise &agrave; jour g&eacute;n&egrave;re automatiquement une sauvegarde des fichiers sensibles (une archive .zip : file_backup_ suivi de l'heurodatage) disponible dans <code>/lib/deployer/npds_backups/</code></li>
            <li>La migration de la base de donn&eacute;es c'est une mise &agrave; jour de la structure et une mise &agrave; jour des donn&eacute;es des tables <strong>fonctions</strong> et <strong>metalang</strong>. Elle est bas&eacute;e sur une comparaison des deux fichiers contenant le sch&eacute;ma SQL : le fichier en cours d'utilisation et le fichier provenant de la nouvelle version.
               <ul>
                  <li>pour la mise &agrave; jour structurelle, des requ&ecirc;tes UPDATE seront g&eacute;n&eacute;r&eacute;es en fonction de la comparaison.</li>
                  <li>pour la mise &agrave; jour des donn&eacute;es des tables <strong>fonctions</strong> et <strong>metalang</strong>, des requ&ecirc;tes <code>DELETE/INSERT</code> seront g&eacute;n&eacute;r&eacute;es. Cette op&eacute;ration pr&eacute;serve vos customisations tout en mettant &agrave; jour le code syst&egrave;me. (cette mise &agrave; jour de ces deux tables est syst&eacute;matique)</li>
               </ul>
            </li>
            <li>Toute la proc&eacute;dure de mise &agrave; jour du portail est monitor&eacute;e et consign&eacute;e dans les logs de php et les logs de npds (<code>/slogs/install.log</code>)</li>
         </ul>
         </p>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Manuel administration</span></p>
      </div>
   </body>
</html>