<!DOCTYPE html>
<html lang="fr">
   <head>
      <meta charset="utf-8" />
      <title>Administration - balises meta</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
            <ol class="breadcrumb bg-transparent">
               <li><a href="admin.html"><img class="me-3 ms-n3" width="32px" height="32px" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></a></li>
               <li class="breadcrumb-item"><a href="men_gen.html">Menu</a></li>
               <li class="breadcrumb-item"><a href="men_syst.html">Syst&egrave;me</a></li>
               <li class="breadcrumb-item active" aria-current="page">Balises meta</li>
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3 class="mb-3">Administration - Balises meta</h3>

         <h4>Les balises meta</h4>
         <p>Les balises meta sont des balises particuli&egrave;res du langage HTML. Elles permettent notamment de r&eacute;f&eacute;rencer votre site aupr&egrave;s des moteurs de recherche comme Altavista, Yahoo ou Hotbot. Plus de la moiti&eacute; des internautes passent par des moteurs de recherche, il est donc important de soigner le r&eacute;f&eacute;rencement de son site pour y appara&icirc;tre de fa&ccedil;on correcte.</p>
         <p>A savoir que les balises meta ne doivent pas &ecirc;tre coup&eacute;es : on ne revient pas &agrave; la ligne dans ce type balise !. N'utilisez donc pas &lt;br /&gt; dans les champs du formulaire.</p>

         <h4>Balises meta param&eacute;trables (les plus courantes)</h4>
         <p><b>meta &quot;Author&quot;</b><br />
         Cette balise est peu utilis&eacute;e par les moteurs de recherche. Seul Nomade indique le nom de l'auteur.</p>
         <p><b>meta &quot;Owner&quot;</b><br />
         Cette balise indique le nom du propri&eacute;taire du site.</p>
         <p><b>meta &quot;Reply-to&quot;</b><br />
         Cette balise indique l'adresse e-mail principale de l'auteur du site. Elle permet entre autre aux internautes qui ont enregistr&eacute; votre page de vous contacter.</p>
         <p><b>meta &quot;Description&quot;</b><br />
         Cette balise doit d&eacute;crire le plus fid&egrave;lement possible le contenu du site. Il s'agit d'une phrase !. Attention &agrave; ne jamais d&eacute;passer les 200 caract&egrave;res (une lettre accentu&eacute;e valant pour un caract&egrave;re).</p>
         <p><b>meta &quot;Keywords&quot;</b><br />
         Cette balise permet d'indiquer les principaux mots-cl&eacute;s qui se r&eacute;f&egrave;rent &agrave; la page / au site. Les mots-cl&eacute;s ne doivent pas &ecirc;tre s&eacute;par&eacute;s par des espaces mais par des virgules. On peut mettre jusqu'&agrave; 100 mots (ou 1000 caract&egrave;res). Les majuscules et minuscules ont une importance pour les moteurs de recherche.</p>
         <p><b>meta &quot;Rating&quot;</b><br />
         Cette balise permet de d&eacute;finir le public vis&eacute;. Les appr&eacute;ciations sont General ou Mature ou Restricted ou 14 years pour respectivement tout public, adulte, acc&egrave;s restreint ou 14 ans.</P>
         <p><b>meta &quot;Distribution&quot;</b><br />
         Cette balise indique si le document est largement diffus&eacute; (Global) ou s'il est &agrave; diffusion restreinte (Local).</p>
         <p><b>meta &quot;Copyright&quot;</b> <br />
         Cette balise est <U>peu utilis&eacute;e</U> mais rappelle simplement le copyright lorsqu'elle est pr&eacute;sente (notion implicite &agrave; l'usage de tout document pr&eacute;sent sur la toile mais h&eacute;las trop peu souvent pr&eacute;sente &agrave; l'esprit de nombreux internautes).</p>
         <p><b>meta &quot;Robots&quot;</b><br />
         Cette balise vous permet d'indiquer aux robots des moteurs de recherche la m&eacute;thode qu'ils doivent utiliser lors de l'ind&eacute;xation de votre site.</p>
         <p><b>meta &quot;Revisit-After&quot;</b><br />
         Cette balise indique le d&eacute;lai d'attente du robot avant une prochaine indexation. Elle ne peut &ecirc;tre inf&eacute;rieure &agrave; 14 jours (14 days).</p>

         <h4>Autres balises meta automatiquement param&eacute;tr&eacute;es</h4>
         <p><b>meta &quot;Content-Script-Type&quot;</b><br />
         Cette balise d&eacute;finit la nature des scripts utilis&eacute;s par le site (ici text/javascript). Remarque : elle sert uniquement au navigateur.</p>
         <p><b>meta &quot;Content-Style-Type&quot;</b><br />
         Cette balise d&eacute;finit la nature des styles utilis&eacute;s par le site (ici text/css). Remarque : elle sert uniquement au navigateur.</p>
         <p><b>meta &quot;Identifier-url&quot;</b><br />
         Cette balise permet d'indiquer l'url principale de votre site. Elle reprend l'adresse principale d&eacute;finit dans le fichier de configuration de NPDS.</p>
         <p><b>meta &quot;Generator&quot;</b><br />
         Cette balise n'a aucun int&eacute;r&ecirc;t pour le r&eacute;f&eacute;rencement aupr&egrave;s des moteurs de recherche. Elle indique seulement le g&eacute;nial outil utilis&eacute; par cr&eacute;er/g&eacute;rer le site web et donc le bien nomm&eacute; NPDS ;-)</p>
         <p><b>meta &quot;Pragma&quot;</b><br />
         Cette balise permet principalement de neutraliser la mise en cache des pages par le navigateur (essentiellement pour Netscape). Cela force donc le chargement de la page &agrave; chaque visite de celle-ci (no-cache).</p>
         <h5>Les balises meta avec propriété og (Open Graph) et twitter</h5>
         <p>Ces balises s'adressent spécifiquement aux réseaux sociaux. Elles permettent l'affichage automatique d'information (titre, description ,image ...) de votre site dans les réseaux sociaux. Nous en avons implémentés 6 de manière à couvrir de manière standard les principaux réseaux sociaux.</p>
         <ul>
            <li><b>og:type</b><br />type de contexte paramétrée à website</li>
            <li><b>og:url</b><br />url du site</li>
            <li><b>og:title</b><br />titre du site</li>
            <li><b>og:description</b><br />description du site</li>
            <li><b>og:image</b><br />image du site<br /> nota bene : vous pouvez choisir votre image en conservant l'url et le nom du fichier : <code>/images/ogimg.jpg</code></li>
            <li><b>twitter:card</b><br />paramétrée à summary</li>
         </ul>

         <h4>La balise &lt;title&gt; (cas particulier)</h4>
         <p><b>Title</b><br />
         Les moteurs de recherche tiennent fortement compte du titre des documents. Il faut imp&eacute;rativement en mettre sur toutes les pages d'un site. Dans le cas de NPDS, le titre du site est unique pour toute les pages. Ce param&egrave;tre est modifiable dans les &quot;pr&eacute;f&eacute;rences&quot; de NPDS et dans le fichier pages.php du r&eacute;pertoire themes. Attention toutefois &agrave; ne jamais d&eacute;passer les 100 caract&egrave;res (une lettre accentu&eacute;e valant pour un caract&egrave;re).</p>
         <p>Remarque : le fait de reprendre un ou des mot(s)-cl&eacute;(s) dans le titre des pages d'un site est favorable pour un meilleur classement.</p>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Manuel administration</span></p>
      </div>
   </body>
</html>