<!DOCTYPE html>
<html lang="fr">
   <head>
      <meta charset="utf-8" />
      <title>Administration - Article</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
            <ol class="breadcrumb bg-transparent">
               <li><a href="admin.html"><img class="me-3 ms-n3" width="32px" height="32px" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></a></li>
               <li class="breadcrumb-item"> <a href="men_gen.html">Menu</a></li>
               <li class="breadcrumb-item"><a href="men_contenu.html">Contenu</a></li>
               <li class="breadcrumb-item active" aria-current="page" >Nouvel article</li>
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3>Nouvel article</h3>
         <p>C'est la fonction principale du CMS.</p>
         <p>Tout ce que vous allez &eacute;crire ici sera publiable sur votre site, soyez attentif &agrave; l'orthographe, la syntaxe et aux URLs.</p>

         <h4>Titre</h4>
         <p>Pour le titre soyez synth&eacute;tique.</p>

         <h4>Sujet</h4>
         <p>S&eacute;lectionnez le sujet de rattachement de cet article. Si aucun sujet &eacute;tait saisi, c'est le premier de la base de donn&eacute;e qui sera affich&eacute;.</p>

         <h4>Cat&eacute;gorie</h4>
         <p>S&eacute;lectionnez ou cr&eacute;er la cat&eacute;gorie dans laquelle vous voulez que votre article apparaisse. (Par d&eacute;faut : Article, mais vous pouvez en cr&eacute;er d&rsquo;autres en cliquant sur ajouter.<br />
         Une cat&eacute;gorie est une sorte d'&eacute;tiquette qui permet une recherche depuis le plan du site, le bloc cat&eacute;gorie si vous l'activez, et sera pr&eacute;sente avant le titre de l'article sur la page index-news sur certains th&egrave;mes.</p>

         <h4>Publier dans la racine</h4>
         <p>Cette fonction vous permet de choisir si l&rsquo;article sera affich&eacute; en page d&rsquo;accueil lors de sa publication.</p>

         <h4>Seulement aux membres</h4>
         <p>
            <ul>
               <li>Oui : vous avez &eacute;galement la possibilit&eacute; de s&eacute;lectionner un groupe que vous aurez d&eacute;fini dans la gestion des groupes</li>
               <li>Non : votre article sera visible par tout le monde y compris les anonymes.</li>
            </ul>
         </p>

         <h4>Texte d'introduction</h4>
         <p>Vous pouvez utiliser du HTML, du CSS, les m&eacute;ta-mots de NPDS (par exemple : !date!).<br />
         Les articles permettent aussi d'afficher du code PHP, C, Perl, il faut encadrer votre code source par les pseudo-balises [code]source[/code].<br />
         NPDS produit du code xhtml valide en utilisant l'&eacute;diteur int&eacute;gr&eacute; Tiny mce.</p>
         <p>Si l'article n'est pas tr&egrave;s long vous n'utiliserez pas la fen&ecirc;tre suivante du texte &eacute;tendu.</p>

         <h4>Texte étendu</h4>
         <p>Si votre article est long, la partie la plus importante doit aller dans cette zone.<br />
         Quand un article publi&eacute; contient un texte &eacute;tendu, le lien <em>Lire la suite ...</em> s'affichera automatiquement à la fin de l'article.<br />
         Cette zone dispose des m&ecirc;me capacit&eacute;s que la zone article.</p>

         <h4>Date de publication</h4>
         <p>Choisissez la date et l&rsquo;heure &agrave; laquelle vous voulez que l&rsquo;article s&rsquo;affiche sur votre site. Selon votre choix, l&rsquo;article sera publi&eacute; imm&eacute;diatement ou alors sera stock&eacute; dans auto-articles.</p>

         <h4>Date de fin de publication</h4>
         <p>S&eacute;lectionnez la date &agrave; laquelle vous voulez que votre article ne s&rsquo;affiche plus.<br />
         Il sera alors not&eacute; archiv&eacute; dans la liste figurant sous la partie administration.<br />
         Vous pourrez &agrave; nouveau l&rsquo;afficher sans avoir &agrave; re-saisir le texte.<br />
         Astuce : si vous ne voulez pas de fin de publication ni d&rsquo;archivage, choisissez une date lointaine 2110 par d&eacute;faut.</p> 

         <h4>Epuration de l'article &agrave; la fin de sa date de validit&eacute;</h4>
         <p>Si vous s&eacute;lectionnez oui, l&rsquo;article sera d&eacute;finitivement effac&eacute; &agrave; la date d&eacute;finie dans date de fin de publication.</p>

         <h4>Pr&eacute;visualiser</h4>
         <p>Pour acc&eacute;der &agrave; la possibilit&eacute; de publier l'article vous devez cliquer sur le bouton pr&eacute;visualiser, l'article sera visible de l'administrateur et vous aurez toujours la possibilit&eacute; d'apporter des corrections ou modifications.</p>

         <h4>Publier un article Admin</h4>
         <p>Si vous &ecirc;tes certain de votre orthographe, des codes HTML, des URLs...vous publiez en changeant d'&eacute;tat pour passer de Pr&eacute;visualiser &agrave; Poster un article admin puis vous cliquez sur le bouton OK : votre article sera en ligne en fonction de vos param&egrave;tres d&eacute;finis de date de publication.</p>
         <p><strong>Astuce :</strong> mettre une date de publication &eacute;loign&eacute;e vous permet de pr&eacute;parer un article et de le sauvegarder, il sera alors accessible par le lien articles programm&eacute;s de la premi&egrave;re rang&eacute;e d&eacute;di&eacute;e aux messages d'alerte.</p>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Manuel administration</span></p>
      </div>
   </body>
</html>