<html>
<title>Edition des Utilisateurs - NPDS V</title>
<head>
</head>
<body bgcolor=FFFFFF text=000000>
<font face=Verdana,Arial,Helvetica size=2>
<center><b>Edition des Utilisateurs</b></center>
<br /><br />
Avec cette fonction, vous pouvez ajouter, modifier et supprimer les membres de votre site.<br /><br />

<b>Ajouter un nouvel utilisateur :</b><br />
Remplissez le formulaire. Les champs obligatoires sont marqu&eacute;s d'une * (Surnom, Email, Mot de Passe).<br />
Les autres champs sont facultatifs. L'adresse Email masqu&eacute;e est celle que NPDS pr&eacute;sentera aux utilisateurs du
portail. <b>N'utilisez surtout pas la vraie adresse Email de l'utilisateur</b>.<br />
Cliquez sur le bouton <i>Ajouter un utilisateur</i> pour finir. Le syst&egrave;me enverra un Email contenant le Mot de Passe &agrave; l'utilisateur
ainsi cr&eacute;&eacute;.<br /><br />
<b>Le rôle de l'Utilisateur : </b><br />
Vous pouvez attribuer un rôle particulier &agrave; un membre (par exemple administrateur du site ...). Le forum affichera cette information. La gestion de cette liste se fait via la configuration des forums.
<br /><br />
<b>Le Groupe : </b><br />
Un utilisateur peut-&ecirc;tre membre de 0 &agrave; n groupes et la valeur du groupe est comprise entre 2(mini) et 126(maxi).
Les groupes d'appartenance sont s&eacute;par&eacute;s par une virgule dans la table.<br />
 - ex : 2,25 (membre des groupes 2 et 25)<br /><br />
La liste des groupes disponibles est affich&eacute;e, et permet la multi-s&eacute;lection.<br />Le premier choix permet de supprimer l'affectation d'un membre aux groupes.<br /><br />
Un groupe est simplement un niveau de rattachement qui permettra de facilit&eacute; la gestion de certaines fonctions (voir les blocs).
<br /><br />
<b>Autoriser la connexion : </b><br />
Par d&eacute;faut si la bonne option des Pr&eacute;f&eacute;rences est positionn&eacute;e &agrave; Oui, un membre, d&egrave;s qu'il a re&ccedil;u sont MDP peut se connecter.<br />
Vous pouvez supprimer cette possibilit&eacute; (et donc interdire la connexion pour un membre).<br />
<br />
<b>Editer un Utilisateur :</b><br />
Saisissez le Surnom dans le champ <i>Identifiant Utilisateur</i>, s&eacute;lectionnez l'option <i>Modifer un utilisateur</i> et cliquez sur
le bouton <i>Ok</i>.<br />
L'ensemble des informations du compte seront modifiables (m&ecirc;me le Mot de Passe).<br /><br />

<b>Supprimer un Utilisateur :</b><br />
Saisissez le Surnom dans le champ <i>Identifiant Utilisateur</i>, s&eacute;lectionnez l'option <i>Supprimer un utilisateur</i> et cliquez sur
le bouton <i>Ok</i>.
<br /><br />

<b>D&eacute;sabonner un Utilisateur :</b><br />
Saisissez le Surnom dans le champ <i>Identifiant Utilisateur</i>, s&eacute;lectionnez l'option <i>D&eacute;sabonner un utilisateur</i> et cliquez sur
le bouton <i>Ok</i>.
<br /><br />

<center><img src="../../images/admin/manuels.gif" border="0" /></center>
</font>
</body>
</html>