<!DOCTYPE html>
<html lang="fr">
   <head>
      <meta charset="utf-8" />
      <title>Administration - Liens</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
            <ol class="breadcrumb bg-transparent">
               <li><a href="admin.html"><img class="me-3 ms-n3" width="32px" height="32px" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></a></li>
               <li class="breadcrumb-item"> <a href="men_gen.html">Menu</a></li>
               <li class="breadcrumb-item"><a href="men_contenu.html">Contenu</a></li>
               <li class="breadcrumb-item active" aria-current="page" >Les liens</li>
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3 class="mb-3">Administration - Liens</h3>
         <p>La base de liens web est une fonction importante de NPDS. Sa maintenance est simple mais n&eacute;cessite une certaine rigueur.<br />
         Elle permet la cr&eacute;ation d'un index de type Yahoo avec un moteur de recherche autonome du reste du site.
         </p>

         <h4>Liens en attente de validation</h4>
         <p>Vous disposerez de cette option que si un lien est en attente (sic ...).<br />
         Vous pouvez modifier le titre, le lien et son commentaire, le nom et l'email du d&eacute;positaire, la cat&eacute;gorie.<br />
         Vous pouvez enfin choisir de publier le lien en cliquant sur le bouton <em>Ajouter</em> ou  le supprimer.</p>

         <h4>Nettoyer la base de liens</h4>
         <p>Cette option permet de remettre &agrave; z&eacute;ro les votes pour l'ensemble des liens de la base.</p>
         <h4>Soumission de liens bris&eacute;s</h4>
         <p>Les options applicables &agrave; la liste sont :
            <ul>
               <li><em>Ignorer</em> permet d'effacer toutes les demandes pour un lien donn&eacute;.</li>
               <li><em>Effacer</em> permet d'effacer les liens cass&eacute;s et les avis pour un lien donn&eacute;.</li>
            </ul>
         </p>

         <h4>Soumission de modification de liens</h4>
         <p>Pour chaque lien, vous aurez l'origine (actuellement stock&eacute; dans la base) et la proposition de modification.</p>
         <p>Les options applicables sont :
            <ul>
               <li><em>Ignorer</em> permet d'effacer toutes les demandes pour un lien donn&eacute;.</li>
               <li><i>Effacer</i> permet d'effacer les liens cass&eacute;s et les avis pour un lien donn&eacute;.</li>
               <li>cliquer sur le lien Auteur ou Propri&eacute;taire pour envoyer un Email.</li>
            </ul>
         </p>

         <h4>Ajouter une cat&eacute;gorie principale</h4>
         <p>Pour la structuration de l'index, saisissez un titre et une description (classement par ordre alphab&eacute;tique).</p>

         <h4>Ajouter une sous-cat&eacute;gorie</h4>
         <p>Pour la structuration de l'index, saisissez une sous-cat&eacute;gorie affect&eacute;e &agrave; une cat&eacute;gorie principale (un seul niveau / classement par ordre alphab&eacute;tique).</p>

         <h4>Ajouter un nouveau lien</h4>
         <p>Saisissez le titre <strong>(avec &agrave; la suite des balises html (br, img src (locale ou distante), ...) si vous le souhaitez)</strong>, l'URL, la cat&eacute;gorie (et sous-cat&eacute;gorie), la description, le nom du propri&eacute;taire et son email. Cliquez sur le bouton <em>Ajouter</em>.</p>

         <h4>Modifier la cat&eacute;gorie</h4>
         <p>Cette fonction vous permet de modifier le nom d'une cat&eacute;gorie et/ou sous-cat&eacute;gorie.<br />
         Elle permet aussi de supprimer une cat&eacute;gorie et/ou sous-cat&eacute;gorie et tous les &eacute;l&eacute;ments rattach&eacute;s (avec message de confirmation).</p>

         <h4>Modifier les liens</h4>
         <p>NPDS vous pr&eacute;sente la liste des liens actuellement disponibles dans la base. Cliquez sur un lien pour l'&eacute;diter.<br />
         Vous pouvez modifier toutes les informations, y compris le nombre de hits (pour positionner plus avantageusement un lien ...).<br />
         Vous pouvez aussi effacer le lien s&eacute;lectionn&eacute;.</p>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Manuel administration</span></p>
      </div>
   </body>
</html>