<p>Page central.html : me sert ici &agrave; pr&eacute;senter les diverses classes de mise en forme de Knacss<br /><br />Ce document met en lignes ce que j'ai compris des explications du site kcnacss</p>
<p>&nbsp;</p>
<h4>Gestion des positionnements</h4>
<div>span class="left mrs"
<div>div class="mod" <br /> Les bo&icirc;tes et box-sizing box-sizing est une propri&eacute;t&eacute; CSS3 qui a, semble-t-il, &eacute;t&eacute; invent&eacute;e pour nous faciliter la vie. De plus, elle a le bon go&ucirc;t d'&ecirc;tre compatible depuis IE8. Elle poss&egrave;de un avantage ind&eacute;niable : gr&acirc;ce &agrave; elle, la largeur de la bo&icirc;te concern&eacute;e est toujours connue, c&rsquo;est celle de la propri&eacute;t&eacute; width. M&ecirc;me si on ajoute des padding et bordures. En clair, finis les probl&egrave;mes de calculs savants pour conna&icirc;tre la taille d'un block dont les caract&eacute;ristiques sont les suivantes
<pre>div {      width: 50%;      padding: 1em;      border-width: 1px;  }</pre>
<p>Deux &eacute;l&eacute;ments sont essentiels dans la l'architecture de KNACSS : le module (.mod) et la ligne (.line).</p>
</div>
</div>
<h4>les GRIDS une gestion facile des &eacute;l&eacute;ments</h4>
<p>&nbsp;</p>
<div>
<div>
<p>mon premier paragraphe ici entre les balise "p"</p>
</div>
<div>
<p>Mon second paragrgaphe ici, encore entre les balise "p", je tape le code au kilomettre juste des balises html simple pour la mise en forme</p>
</div>
<div>
<p>Yeuh non che suis au r&eacute;chime, je ne mange plus que des Grumbeere light et che fais de la chym avec Chulien. <br /> Tiens, un Picon sur le comptoir. Hopla, KNACSS !</p>
</div>
</div>
<p>&nbsp;</p>
<h4>le positionement tabulaire</h4>
<p>div class="col w33" <br /> je prend 33% de l'espace dans lequel je suis int&eacute;gr&eacute;. div class="col w20" <br /> 
Ici je ne prend plus que 20% de ce m&ecirc;me espace div class="col" <br /> Pas de taille donn&eacute; ici que ce passe t'il? <br /> Et bien naturellement je prend l'espace restant qui est disponible sur mon parent, logique non?</p>