<!DOCTYPE html>
<html lang="es">
   <head>
      <meta charset="utf-8" />
      <title>Administraci&oacute;n NPDS</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
            <ol class="breadcrumb bg-transparent">
               <li class=""><img class="me-3 ms-n3 " width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></li>
               <li class="breadcrumb-item active" aria-current="page">Administraci&oacute;n</li>
               <li class="breadcrumb-item"> <a href="men_gen.html">Men&uacute;</a></li> 
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3 class="mb-3">Administraci&oacute;n</h3>
         <p>Bienvenidos a las p&aacute;ginas de administraci&oacute;n de NPDS.</p>
         <p>NPDS es un portal de gran alcance en Open-Source escrito en licencia (libre) bajo licencia GNU-GPL usando tecnolog&iacute;as de PHP y de MySql.<br />
         NPDS es una herramienta de gran alcance su lengua materna es francesa, aunque puede utilizar otros idiomas (NPDS se ofrece con los archivos ingleses, franceses, Chinos y espa&ntilde;oles)</p>
         <p>El contenido y la interfaz de esta p&aacute;gina dependen obviamente de los derechos que tenga como administrador (el superadministrador, por lo tanto, tendr&aacute; acceso a todas las funciones interconectadas). La interfaz general se divide en 3 bloques principales.</p>

         <h4>Alertas y notificaciones</h4>
         <p>El primer bloque recopila las alertas / notificaciones que le permiten ocuparse de las tareas de administrador pendientes. (artículos propuestos, artículos programados, usuarios en espera de validación, enlaces nuevos, enlaces rotos, etc.)</p>

         <h4>Las funciones</h4>
         <p>Para administrar NPDS, tiene acceso a muchos botones que están agrupados por filas de acuerdo con una clasificación por tipo. Tienen forma de iconos o texto según la configuración de la interfaz gráfica definida en las preferencias.</p>
            <ul>
               <li>Los botones de la primera fila le permiten administrar el contenido de su sitio, una vez que haya hecho clic en un botón debe hacer clic en el botón manual en línea para obtener la documentación relacionada con la función abierta.</li>
               <li>La segunda fila le permite administrar los usuarios del portal.</li>
               <li>La tercera fila te permite gestionar todo lo relacionado con la comunicación.</li>
               <li>La cuarta fila le permite administrar la interfaz de los bloques.</li>
               <li>La quinta fila le permite actuar en el sistema, el enlace de preferencias es uno de los enlaces más importantes. Tenga en cuenta el enlace que le permite instalar un módulo y averiguar qué módulos ya están instalados o no.</li>
               <li>Finalmente la última fila que le permite administrar módulos con administraci&oacute;n</li>
            </ul>
         </p>

         <h4>Art&iacute;culos del &uacute;ltimo XX</h4>
         <p>
            <ul>
               <li>Muestra la lista de los &uacute;ltimos x art&iacute;culos publicados en su sitio</li>
               <li>El primer registro es el &uacute;ltimo art&iacute;culo publicado</li>
               <li>Ciertos art&iacute;culos pueden ser indicados en archivo, estos son los art&iacute;culos que han pasado su fecha de finalizaci&oacute;n de publicaci&oacute;n.</li>
               <li>Para volver a colocar estos art&iacute;culos en el feed, todo lo que tiene que hacer es editarlos, hacer clic en la opci&oacute;n 'cambiar la fecha' y modificar su fecha de finalizaci&oacute;n.</li>
               <li>Haga clic en el art&iacute;culo para editarlo o utilice los enlaces Editar, Eliminar.</li>
               <li>Si desea Editar / Eliminar un elemento antiguo, ingrese su ID y seleccione la acci&oacute;n apropiada.</li>
            </ul>
         </p>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Manual de administraci&oacute;n</span></p>
      </div>
   </body>
</html>