<html>
<head>NPDS
<title>Administration - NPDS V</title>
</head>
<body bgcolor=FFFFFF text=000000>
<font face=Verdana,Arial,Helvetica size=2>
</font><center>
  <font size="2" face="Verdana,Arial,Helvetica"><b>Bienvenidos a las p&aacute;ginas de administraci&oacute;n de NPDS.</b><br />
  <br />
  NPDS es un portal de gran alcance en Open-Source escrito en
licencia (libre) bajo licencia GNU-GPL usando tecnolog&iacute;as de PHP y de MySql.<br />
  <br />
  NPDS es una herramienta de gran alcance su lengua materna es
francesa, aunque puede utilizar otros idiomas (NPDS se ofrece con los archivos ingleses, franceses, Chinos y espa&ntilde;oles)<br />
  <br />
  La administraci&oacute;n es el centro de comandos de NPDS.<br />
  <br /></font>
  
  <center>
    <hr>
  </center>
  <font face=Verdana,Arial,Helvetica size=2>NPDS dispone de una capacidad multi-idioma. "ML" indica si esta capacidad esta activada o desactivada (color rojo).<br />
  <hr>
  <b>Los modulos de la administracion :</b><br />
La presencia de m&oacute;dulos se fijan seg&uacute;n el perfil del administrador entrado (v&eacute;ase para corregir el m&oacute;dulo del admin)<br />
<br />
<strong>Art&iacute;culos del &uacute;ltimo XX:</strong><br />
Affiche les XX derniers articles publi&eacute;s sur votre site. Vous devriez voir comme premier enregistrement, le dernier article publi&eacute;.</font><font face=Verdana,Arial,Helvetica size=2><br />
  Muestra los art&iacute;culos pasados XX publicados en su sitio. La primera l&iacute;nea igual al art&iacute;culo pasado que fue publicado.<br />
  <br />
  Algunos art&iacute;culos “est&aacute;n archivados”, esto significan que expiraron (seg&uacute;n su fecha, sistema de vencimiento al escribir el art&iacute;culo).<br />
  Si necesita ponerlos en el flujo de informaci&oacute;n, solo tendra que corregirlos y cambiar la fecha de publicacion.<br />
</font></center>
<p><font face=Verdana,Arial,Helvetica size=2>Haga click sobre el art&iacute;culo para corregirlo o use los vinculos, Editar / Borrar. Tambi&eacute;n puede entrar el ID y luego seleccionar la acci&oacute;n apropiada.<br />
  <br />
    
</font></p>
<font face=Verdana,Arial,Helvetica size=2>
<center>
  <img src="../../images/admin/manuels.gif" border="0" />
</center>
</font>
</body>
</html>