<!DOCTYPE html>
<html lang="es">
   <head>
      <meta charset="utf-8" />
      <title>Administraci&oacute;n de los Banners / Publicidad</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
            <ol class="breadcrumb bg-transparent">
               <li><a href="admin.html"><img class="me-3 ms-n3" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></a></li>
               <li class="breadcrumb-item"><a href="men_gen.html">Men&uacute;</a></li>
               <li class="breadcrumb-item"><a href="men_com.html">Comunicaci&oacute;n</a></li>
               <li class="breadcrumb-item active">Banners</li>
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3 class="mb-3">Administraci&oacute;n de los Banners / Publicidad</h3>
         <p><strong>NPDS</strong> dispone de un gestor de Banners simple pero integrado al sistema. Pueden aplicar otro sistema de banners.<br />
         &Eacute;ste es suficientemente simple para que esta p&aacute;gina de ayuda baste.</p>
         <p><strong>NPDS</strong> aplica a pesar de todo una funci&oacute;n in&eacute;dita, los Banners vinculados al usuario.
         Un Banner puede efectivamente ser visible por todo el mundo o por los miembros o solo los administradores. Hasta incluso es posible desactivar temporalmente un Banner. 
         El inter&eacute;s de esta funci&oacute;n es poder diferenciar al p&uacute;blico... .<br />
         Para <strong>activar</strong> el sistema de banners: administraci&oacute;n/Preferencias<br />
         Para utilizar los parametros : Haga clic en la zona Banners de la administracion </p>
         <h4>Banners Activos actualmente</h4>
         <p>Esta lista les muestra la actividad de las campa&ntilde;as de banners actualmente en servicio en su pagina web. Esta lista les permite modificar y/o suprimir una campa&ntilde;a en curso.</p>
         <h4>Banners Terminados</h4> 
         <p>Cuando una campa&ntilde;a ha alcanzado el n&uacute;mero de impresi&oacute;n m&aacute;xima, se muestra en esta lista. Pueden seguir la eficacia de la campa&ntilde;a o borrarla.</p>
         <h4>Clientes que hacen la publicidad</h4>
         <p>Esta lista identifica los clientes (y su informaci&oacute;n) as&iacute; como el n&uacute;mero de sus banners en servicio. </font>Esta lista le permite modificar y/o borrar  los clientes.</p>
         <p><strong>Nota:</strong> Si desea poner un banner en visualizaci&oacute;n ilimitada (numeros de impresi&oacute;n), ponga 0 (cero) en el campo Impresiones Compradas.</p>
         <h4>Gesti&oacute;n de las estad&iacute;sticas por sus clientes</h4>
         <p>Un cliente puede consultar instant&aacute;neamente su (o sus) campa&ntilde;a (s) de publicidad en su pagina web. Para ello dispone de un identificador y de una contrase&ntilde;a que le permite conectarse :<br />
         <ul>
            <li>http://sudominio.com/banners.php?op=login</li> 
         </ul>
         En estas p&aacute;ginas, su cliente puede <strong>cambiar las URLs</strong> de sus banners (la p&aacute;gina sobre la cual env&iacute;a al usuario cuando presiona la imagen), ver sus estad&iacute;sticas instant&aacute;neas y pedir un informe autom&aacute;tico por Correo electr&oacute;nico.</p>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Manual de administraci&oacute;n</span></p>
      </div>
   </body>
</html>