<!DOCTYPE html>
<html lang="es">
   <head>
      <meta charset="utf-8" />
      <title>Preferencias</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
            <ol class="breadcrumb bg-transparent">
               <li><a href="admin.html"><img class="me-3 ms-n3" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></a></li>
               <li class="breadcrumb-item"><a href="men_gen.html">Men&uacute;</a></li>
               <li class="breadcrumb-item"><a href="men_syst.html">Sistema</a></li>
               <li class="breadcrumb-item active">Preferencias</li>
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3 class="mb-3">Preferencias</h3>
         <p>Esta funci&oacute;n es la m&aacute;s importante cuando empiezan unapagina Web con <strong>NPDS</strong>. Puede modificar toda la informaci&oacute;n importante de su pagina WEB y sobre todo darle el look y el sentido que deseen. <br />
         Figuran a continuaci&oacute;n una explicaci&oacute;n para los parametros importantes y sobre todo para las nuevas funciones incluidas a <strong>NPDS.</strong></p>
         <h4>Informaci&oacute;n general de la pagina WEB </h4>
         <h5>Parse algo</h5>
         <p>Para las preferencias de su pagina web, pueden elegir una u otras de las funciones de Parse.
            <ul>
               <li>FixQuotes es la funci&oacute;n de origen que duplica los [' ] (p.ej.:<strong> No se aplica en Espa&ntilde;ol</strong>) </li>
               <li>StripSlashes permite no afectar al texto (p.ej.: <strong>No se aplica en Espa&ntilde;ol</strong>) pero puede plantear otros problemas.</li>
            </ul>
         </p>
         <h5>OB_Gzhandler</h5>
         <p>Permite la utilizaci&oacute;n del env&iacute;o de datos comprimidos a los navegadores que soportan las p &aacute;ginas comprimidas.
  Antes de que <b>OB_Gzhandler </b> () env&iacute;e los datos comprimidos, determina los tipos de codificaci&oacute;n que son soportados por el navegador (&quot;gzip&quot;,
  &quot;deflate&quot; o ninguno) y devuelven el contenido de memoria tampon de manera apropiada. Trabaja para todos los navegadores, ya que son los
  navegadores que tienen que enviar un encabezamiento que indica los tipos de p&aacute;ginas
  soportados.<br />
  <br />
Solo funciona con Php 4.05 (o>) + el Zlib activo (hacer un phpinfo ();) y para Apache, el mod_gzip activado.
  <br />
         <h5>FileManager</h5>
         <p>FileManager: Activa o retira el acceso al <strong>FileManager</strong>. &iexcl;Atenci&oacute;n active el<strong> FileManager</strong> solo cuando tenga necesidad!</p>
         <h5>Duraci&oacute;n de vida de los cookies (Admin y Usuario)</h5>
         <p>Sin observaciones (1 a&ntilde;o = las 8760 horas)</p>
         <h5>Nombre de su pagina Web:</h5>
         <p>&iexcl;Su pagina Web tiene un nombre,  es aqu&iacute; donde hay que ponerlo!</p>
         <h5>Nombre de su pagina Web para la baliza Title</h5>
         <p>T&iacute;tulo de las p&aacute;ginas HTML de su pagina (en particular, para los motores de busqueda)</p>
         <h5>Direccion URL</h5>
         <p>http://www.xxx.com o http://www.xxx.com/~homepage/...</p>
         <h5>Logotipo de su pagina Web</h5>
         <p>fichero gif o jpg localizado en el directorio im&aacute;genes de su servidor(por defecto) o en uno de sus temas (camino completo: themes/mi_tema/... /logo.jpg por ejemplo).<br />
         Este fichero solo sirve en las funciones de impresi&oacute;n de NPDS. Una buena cosa es hacer una imagen en blanco y negro </p>
         <h5>Eslogan de su pagina web</h5>
         <p>Si tiene un eslogan es aqui que hay que ponerlo.</p>
         <h5>Fecha de comienzo de su pagina web</h5>
         <p>Una fecha (20/10/1429 o 31 de diciembre de 2012) que solo ser&aacute; visible en las estad&iacute;sticas..</p>
         <h5>Cantidad de elementos en la pagina TOP x</h5>
         <p>Adapte aqui la cantidad de elementos que quiere que aparezcan en el TOP x (5,.10,.15...).</p>
<br />

         <h5>Cuantos articulos o noticias quiere que aparezca en una sola pagina ?</h5>
         <p>Una cifra correcta es 10 pero eso depende de la actividad de su portal. Recuerde que los miembros registrados de <strong>NPDS</strong>  pueden cambiar este valor, por lo tanto este par&aacute;metro no es m&aacute;s que un valor por defecto.</p>
         <h5>Cuantos articulos o noticias antiguas quiere que aparezca</h5>
         <p>En los bloques de la derecha, se encuentra el que muestra una lista de noticias antiguas. Es este n&uacute;mero que usted debe adaptar.</p>
         <h5>Activar Export-News</h5>
         <p>Export-News</b>
         son dos ficheros Texto localizados en
           el directorio oculto de su portal. Por defecto este par&aacute;metro = no.
           <br />
           <br />
         En estos dos ficheros (ultramode.txt et net2zone.txt) se alazenan las
             10 &uacute;ltimas noticias de su portal.<br />
             Este fichero permite en realidad a otros sitios formar canales de
             informaci&oacute;n bas&aacute;ndose en estructuras simples:<br />
             - ultramode.txt es un fichero texto y las noticias estan separadas por estos simbolos %%<br />
             - net2zone.txt es un fichero texto al formato XML de net2zone.
             </font>
             <br />
             La funci&oacute;n &quot;Online&quot; que realiza la misma operaci&oacute;n es Backend que
             soporta el formato RDF/XML o mejor a&uacute;n el M&oacute;dulo NPDS Push Infos
             System.</font>
         <br />

         <h5>Nombre por defecto de An&oacute;nimo</h5>
         <p>Nombre por defecto de los usuarios no registrados. An&oacute;nimo es un buen valor (y tambi&eacute;n hu&eacute;sped, visitante...). no cambien este valor si su  NPDS ya esta en linea.</p>
         <h5>Autorizar la creaci&oacute;n de &quot;Noticias&quot;</h5>
         <p>Permite limitar (o no) la oferta de Noticias a los Moderadores / Administradores o Miembros.<br />
         Esta funci&oacute;n es interesante para un portal de informaci&oacute;n libre y dinamica.
         </p>
         <h5>No tener cuenta de las visitas de los autores en las estad&iacute;sticas</h5>
         <p>Permite no contar el mantenimiento de su portal, como verdaderas visitas (s&iacute; bueno vale...).</p>
         <h5>Tema de visualizaci&oacute;n por defecto del Portal</h5>
         <p>Seleccionan el tema por defecto de su pagina web. Recuerde que los usuarios registrados pueden modificar esta opci&oacute;n (a condici&oacute;n de poner varios temas a disposici&oacute;n...).</p>

         <h5>P&aacute;gina principal</h5>
         <p>Esta funci&oacute;n permite escoger que p&aacute;gina quiere que sea la principal (la recepci&oacute;n) de su Portal por defecto la p&aacute;gina es
         <b>index.php</b> (el sistema de visualizaci&oacute;n de las noticias) pero pueden
         elegir otra funci&oacute;n:
         <ul>
            <li>links.php</li>
            <li>faqs.php</li>
            <li>static.php?op=npds.txt&<b>npds</b>=1 ... (el valor de npds a puede ser -1: sin bloques, 0: bloque izquierdo, 1: bloques izquierdo y derecha)
            <li>EDITO :
               <ul>
                  <li>index.php?op=<b>edito</b> : muestra del sistema editorial <b>y</b> de noticias (no en la parte inferior de las noticias la proxima p&aacute;gina)</li>
                  <li>index.php?op=<b>edito-nonews</b> : muestra del sistema editorial de <b>SIN</b> Noticias</li>
                  <li>index.php?op=<b>newindex</b> : muestra de noticias <b>SIN</b> el sistema editorial (com en la parte inferior de las noticias la proxima p&aacute;gina)</li>
                  <li>index.php?op=<b>edito-newindex</b> : muestra del sistema editorial <b>y</b> de noticias (com en la parte inferior de las noticias la proxima p&aacute;gina)</li>
                  <li>index.php?op=<b>newtopic&topic=X</b> : muestra de noticias relacionada con el tema X <b>SIN</b> el sistema editorial (com en la parte inferior de las noticias la proxima p&aacute;gina)</li>
               </ul>
            </li>
         </ul>
         </p>
         <h5>Activar el Multi-idioma</h5>
         <p>Permite a <strong>NPDS</strong> administrar varios idiomas mediante los tags [langue]...[/langue]<br />
         Piense en parametrear tambi&eacute;n la : Hora Local <br />
         (por ejemplo: [spanish]es_ES[/spanish][french]fr_FR[/french][english]en_EN[/english ]).</p>
         <h5>Hora local</h5>
         <p>sistema UNIX  depende de las funciones &quot;locales&quot; normalmente instaladas bajo/usr/share/locale</p>
         <h5>El d&iacute;a comienza a Y la noche comienza a:</h5>
         <p>Permite regular por ejemplo, el cambio de EDITO a partir de una determinada hora.</p>
         <h5>UTC</h5>
         <p>Permite especificar (en + o -) un desfase por hora con relaci&oacute;n a el de la m&aacute;quina del servidor.</p>

         <h4>Opciones para los banners </h4>
         <h5>Activar los banners en su portal</h5>
         <p>S&iacute; o no quiere activar los banners de publicidad. Eso requiere a pesar de todo que tengan parametrada una campa&ntilde;a publicitaria...</p>
         <h5>Su direcci&oacute;n IP para no contabilizar los hits que proceden</h5>
         <p>Sea honesto, ya que si es administrador de este portal, su puesto (y en consecuencia su direcci&oacute;n IP) debe ser excluida para no &quot;desarreglar&quot; los contadores.</p>

         <h4>Mensajes de pie de p&aacute;gina</h4>
         <h5>L&iacute;nea 1,2,3,4</h5>
         <p>Pie de p&aacute;gina de su pagina web, estas zonas soportan los c&oacute;digos HTML. Si solo necesita una o 2 l&iacute;neas, deje las zonas vac&iacute;as (partiendo del final).<br />
         <p>En general se encuentra la informaci&oacute;n de copyright, de cr&eacute;ditos, el nombre del servidor web etc...</p>

         <h4>Configuraci&oacute;n de la informaci&oacute;n en Backend (canales de informaci&oacute;n al formato RDF/XML)</h4>
         <h5>T&iacute;tulo del Backend:</h5>
         <p>Sin comentarios. Puede poner su lema despu&eacute;sdel T&iacute;tulo.</p>
         <h5>Idioma del Backend</h5>
         <p>el mismo formato que para el idioma de su pagina web.</p>
         <h5>URL de la imagen del Backend</h5>
         <p>El camino completo (http(s)://...) que permite el acceso a una imagen/logotipo de su pagina web.</p>
         <h5>Anchura de la imagen del Backend</h5>
         <p>Sin observaciones.</p>
         <h5>Altura de la imagen del Backend</h5>
         <p>Sin observaciones.</p>


         <h4>Configuraci&oacute;n por defecto de los V&iacute;nculos Web</h4>
         <h5>Cantidad de  v&iacute;nculos por p&aacute;gina</h5>
         <p> El n&uacute;mero maximo de v&iacute;nculos por p&aacute;gina (en la funci&oacute;n V&iacute;nculos Web).</p>
         <h5>Cantidad de hits sobre el v&iacute;nculo para que sea popular</h5>
         <p>Sin observaciones. muestra una peque&ntilde;a estrella a la derecha del v&iacute;nculo cuando se cumple este criterio.</p>
         <h5>Cantidad de v&iacute;nculos ' Nuevo ':</h5>
         <p>La cantidad maxima de v&iacute;nculos en la p&aacute;gina &quot;Nuevo&quot;.</p>
         <h5>Cantidad de v&iacute;nculos ' Populares'</h5>
         <p>La cantidad maxima de v&iacute;nculos en la p&aacute;gina &quot;Populares&quot;.</p>
         <h5>Cantidad de v&iacute;nculos en los resultados de las busquedas :</h5>
         <p>Sin observaciones.</p>
         <h5>Dejar los usuarios an&oacute;nimos a&ntilde;adir nuevos v&iacute;nculos:</h5>
         <p>S&iacute; o no</p>
         <h5>Indicar el Logotipo sobre la p&aacute;gina Vinculos internet :</h5>
         <p>S&iacute; o no. El logotipo ocupa bastante espacio... .</p>
         <h5>Activar el icono [N]uevo para las categor&iacute;as:</h5><p>Muestra, cuando una categor&iacute;a es nueva o  que hay nuevos v&iacute;nculos un peque&ntilde;o s&iacute;mbolo en forma de N grafica.</p>

         <h4>Sistema de mensajer&iacute;a (correo electr&oacute;nico)</h4>
         <h5>Direcci&oacute;n de correo electr&oacute;nico del administrador</h5>
         <p>Se utiliza cuando NPDS env&iacute;a correos electr&oacute;nicos autom&aacute;ticamente y, por lo tanto, permite que el destinatario le responda (direcci&oacute;n de correo electr&oacute;nico v&aacute;lida y autorizada asociada con el servidor de env&iacute;o. => por ejemplo: desarrollador@npds. org).</p>
         <h5>&iquest;Qu&eacute; protocolo de correo electr&oacute;nico utilizar?</h5>
         <p>Usar o no el protocolo SMTP(S)</p>
         <h6>Configuraci&oacute;n de PHPmailer SMTP</h6>
         <p>
            <ul>
               <li>El nombre del servidor de env&iacute;o</li>
               <li>Puerto TCP que se debe utilizar. 587 o 465 (m&aacute;s raro y obsoleto) si utiliza cifrado SMTPS. Para SMTP a veces los puertos 25 o 2525</li>
               <li>Autenticaci&oacute;n: si su servidor la requiere, proporcione: nombre de usuario y contrase&ntilde;a.</li>
               <li>Activa o no el cifrado de tus mensajes durante la transferencia. Y elija el protocolo de cifrado TLS (predeterminado) o SSL (obsoleto). Tenga en cuenta que SMTP solo cifra los mensajes durante la transferencia.</li>
            </ul>
         </p>
         <h6>DKIM</h6>
         <p>Usar el registro DKIM DNS o un registro DKIM generado autom&aacute;ticamente por el portal</p>

         <h4>Moderaci&oacute;n de los comentarios</h4>
         <h5> Tipo de moderaci&oacute;n</h5>
         <p>El sistema de moderaci&oacute;n funciona pero no le des mucha confianza.
            <ul>
               <li>Moderado por el administrador</li>
               <li>Moderado por los Usuarios</li>
               <li>No hay moderaci&oacute;n</li>
            </ul>
         </p>
         <h5>Autorizar los comentarios An&oacute;nimos</h5>
         <p>Si quieren que los usuarios An&oacute;nimos (es decir, no registrados) puedan publicar comentarios, seleccione <strong>s&iacute;</strong> si no... .</p>
         <h5>Cantidad M&aacute;xima de Comentarios por usuario (24H)</h5>
         <p>Para an&oacute;nimo y los miembros, limita el n&uacute;mero de comentarios de los art&iacute;culos y de las encuestas.<br />
         6 por defecto, 99999 para lo m&aacute;ximo.</p>

         <h4>Opciones de los Sondeos</h4> 
         <h5> Cantidad m&aacute;xima de opciones para las Encuestas</h5>
         <p>Sin comentarios.</p>
         <h5>Escala de la barra de los resultados</h5>
         <p>Entienden un n&uacute;mero m&uacute;ltiplo de 100. Este n&uacute;mero servir&aacute; de base para calcular la escala de visualizaci&oacute;n del gr&aacute;fico de resultados. Si pone 3, la escala ser&aacute; de 300%. en un 99,99% de los casos 1 es el buen valor.</p>
         <h5>Autorizar los usuarios a votar varias veces</h5>
         <p>S&iacute; o no, eso depende de usted. Si utiliza s&iacute;, eso indicar&aacute; a <strong>NPDS</strong> de autorizar un usuario a votar cada 24 Horas y un peque&ntilde;o mensaje en los sondeos. En el caso contrario, el voto es &uacute;nico por toda la duraci&oacute;n del sondeo.</p>
         <h5>Activar los comentarios de las encuestas</h5>
         <p>Sin observaciones.</p>

         <h4>Algunas cosillas de car&aacute;cter gr&aacute;fico</h4>
         <p>No cambie esta opci&oacute;n salvo si... .</p>
         <h5>Camino de las im&aacute;genes de los Temas</h5>
         <p>Normalmente /images/topics.</p>
         <h5>Camino de algunas im&aacute;genes (voto...)</h5>
         <p>Normalmente /images/menu/.</p>
         <h5>Camino de las im&aacute;genes del menu Administrador</h5>
         <p>Normalmente images/admin/.</p>
         <h5>Activar las im&aacute;genes en el menu Administraci&oacute;n</h5>
         <p>S&iacute; o no. &quot;<strong>no</strong>&quot; le permitir&aacute; ganar tiempo en la administracion, puesto que las imagenes no seran mostradas, el tiempo de descarga de la pagina sera mas ligero.</p>
         <h5>Activar los menus cortos para la administraci&oacute;n</h5>
         <p>S&iacute; o no. <strong>S&iacute; </strong>le permitir&aacute; ganar tiempo.</p>

         <h4>Varios</h4>
         <h5> Cuantas noticias en m&eacute;todo Administraci&oacute;n</h5>
         <p>Sin observaciones (pero este valor se utiliza tambi&eacute;n para las r&uacute;bricas...).</p>
         <h5>Longitud m&iacute;nima de las contrase&ntilde;as Usuarias</h5>
         <p>8 es un buen valor.</p>
         <h5>cantidad de usuarios &quot;listados&quot;</h5>
         <p>En el anuario antes de pasar a la p&aacute;gina siguiente.</p>
         <h5>Activar los Avatares</h5>
         <p>NPDS permite no utilizar los avatares (peque&ntilde;a imagen) para la creaci&oacute;n de los iembros, los foros... </p>
         <h5>Tama&ntilde;o m&aacute;ximo de los avatares personales</h5>
         <p>(anchura * altura/60*80) en pixel<br />
         NPDS permite especificar el tama&ntilde;o m&aacute;ximo de los avatares que el usuario puede poner en el servidor de su pagina web.</p>
         <h5>Activar la descripci&oacute;n corta de los usuarios</h5>
         <p><strong><em>NPDS</em></strong> permite no pedir a un nuevo usuario la introducci&oacute;n de sus direcciones ICQ, MSN... .</p>
         <h5>Autorizar la creaci&oacute;n autom&aacute;tica de los miembros</h5>
         <p><strong><em>NPDS</em></strong> permite no autorizar a un nuevo miembro a conectarse sin una intervenci&oacute;n del administrador (valor: autorizar la conexi&oacute;n de la ficha usuarios). Pr&aacute;ctica para los portales &quot;cerrados&quot;.</p>
         <h5>Autorizar los usuarios a elegir su Contrase&ntilde;a</h5>
         <p>Puede autorizar a un nuevo usuario a elegir la Contrase&ntilde;a que desea utilizar. Puede tambi&eacute;n acoplar esta opci&oacute;n a la anterior para evitar &quot;dejar&quot; hacer sus nuevos miembros.</p>
         <h5>Autorizar las suscripciones</h5>
         <p>Autoriza sus miembros a suscribirse a las distintas fuentes de informaci&oacute;n de NPDS (Temas, Foros, Mensajes Internos...) y en consecuencia a recibir un Correo electr&oacute;nico de informaci&oacute;n (atenci&oacute;n esto puede generar una carga importante).</p>
         <h5>Cerrar las Nuevas Inscripciones</h5>
         <p><em><strong>NPDS</strong></em> permite cerrar temporalmente la inscripci&oacute;n de los nuevos miembros (la p&aacute;gina static/closed.txt se indica). Pr&aacute;ctica para cerrar el portal.</p>
         <h5>Activar los referientes HTTP</h5>
         <p>Sin observaciones.</p>
         <h5>Cu&aacute;ntos referientes como m&aacute;ximo</h5>
         <p>No cargue demasiado su base de datos.</p>
         <h5>Lista de los miembros</h5>
         <p><em>Privada:</em> NPDS permite  indicar el anuario solamente a los miembros.</p>
         <h5>R&uacute;brica de cobro a distancia</h5>
         <p>Escoja la r&uacute;brica (categor&iacute;a) de las descargas que se vera primero O ninguna.</p>
         <h5>Cr&iacute;ticas cortas</h5>
         <p>Transforme las cr&iacute;ticas en libro de oro.</p>

         <h4>Varios HTTP</h4>
         <h5>Activar para los Grandes T&iacute;tulos de sitios de News, la comprobaci&oacute;n de la existencia de un Web 80</h5>
         <p>NPDS permite no pedir la comprobaci&oacute;n de la existencia de una Red sobre el puerto 80 Pr&aacute;ctica para Multimania y otros ISP.</p>
         <h5> Activar para las p&aacute;ginas HTML generadas, los tags avanzados de gesti&oacute;n de la m&aacute;scara</h5>
         <p><strong>NPDS</strong> permite utilizar las funciones avanzadas de gesti&oacute;n de la m&aacute;scara de las p&aacute;ginas HTML algunos ISP no lo autorizan (como Multimania).</p>
         <h5>Activar la Resoluci&oacute;n DNS para los mensajes (Foro...)</h5>
         <p><strong>NPDS</strong> permite 'capturar' al mismo tiempo que la direcci&oacute;n IP, el Nombre DNS. Atenci&oacute;n esta opci&oacute;n quiz&aacute; sea consumidora de CPU en el servidor (o incluso prohibida).</p>

         <h4>Varios SYSTEM</h4>
         <h5>Tama&ntilde;o m&aacute;ximo de las copias de seguridad de SaveMysql</h5>
         <p>Tama&ntilde;o de los ficheros de dump ASCII antes de la compresi&oacute;n.</p>
         <h5>Tipo de copia de seguridad</h5>
         <p>Tipo de resultado deseado en la protecci&oacute;n.</p>
         <h5>Activar el editor Tiny-Mce</h5>
         <p>NPDS puede utilizar <strong>Tiny-Mce</strong>.</p>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Manual de administraci&oacute;n</span></p>
      </div>
   </body>
</html>