<!DOCTYPE html>
<html lang="es">
   <head>
      <meta charset="utf-8" />
      <title>Descargas</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
            <ol class="breadcrumb bg-transparent">
               <li><a href="admin.html"><img class="me-3 ms-n3" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></a></li>
               <li class="breadcrumb-item"><a href="men_gen.html">Men&uacute;</a></li>
               <li class="breadcrumb-item"><a href="men_contenu.html">Contenido</a></li>
               <li class="breadcrumb-item active">Descargas</li>
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3 class="mb-3">Descargas</h3>
         <p>Esta funci&oacute;n les permite administrar la aplicaci&oacute;n &quot;<b>Descargas</b>&quot; de su Portal. Esta funci&oacute;n a puesto que muy utilizada, preste un cuidado especial a lo que escribe en ella.</p>
         <p>Se indica una lista de los ficheros actualmente disponibles en <b>Descargas</b> con el conjunto de la informaci&oacute;n disponible (n&uacute;mero, contador, url de cargamento, nombre del fichero...) as&iacute; como los v&iacute;nculos permitiendo la modificaci&oacute;n y/o la supresi&oacute;n del fichero.</p>
         <h4>Edicion de una Descarga</h4>
         <p>Presione el v&iacute;nculo Edicion para poder indicar y modificar la informaci&oacute;n de la <b>Descarga</b>. Para terminar presionan el bot&oacute;n salvar.<br />
         Pueden cambiar la fecha (actualizaci&oacute;n) y cambiar los privilegios sobre esta pantalla.<br />
         &iexcl;Compruebe su sintaxis as&iacute; como el URL de cargamento!</p>
         <h4>Suprimir un fichero</h4>
         <p>Presione el v&iacute;nculo borrar de la <b>Descarga</b> que desean suprimir. Un mensaje de confirmaci&oacute;n le pide de validar su petici&oacute;n.</p>
         <h4>A&ntilde;adir una Descarga</h4>
         <ul>
            <li>Insere la URL (externa o interna a su Dominio) o presione Recorrer.  &iexcl;Recorrer permite navegar en su servidor en una una nueva ventana y ' Copiar ' pone directamente al d&iacute;a el formulario!</li>
            <li>El contador puede ser inicializado con un valor (no &eacute;xag&eacute;re...).</li>
            <li>Para que NPDS calcule autom&aacute;ticamente el tama&ntilde;o del fichero, no ponga nada en el campo &quot;tama&ntilde;o del fichero&quot;<br />
            <li>Versi&oacute;n, tama&ntilde;o, v&iacute;nculo hacia la p&aacute;gina Internet del proprietario, nombre del proprietario son campos facultativos.</li>
            <li>Categor&iacute;a, descripci&oacute;n y privilegios son campos obligatorios.</li>
         </ul>
        Nota:<br />
         <ul>
            <li>Para a&ntilde;adir una categor&iacute;a, ponga simplemente un nuevo t&eacute;rmino en el campo.</li> 
            <li>Cuidado con los privilegios, An&oacute;nimo permite una <b>Descarga</b></font> por cualquier usuario.</li>
         </ul>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Manual de administraci&oacute;n</span></p>
      </div>
   </body>
</html>