<!DOCTYPE html>
<html lang="es">
   <head>
      <meta charset="utf-8" />
      <title>Configuraci&oacute;n de los Foros</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
            <ol class="breadcrumb bg-transparent">
               <li><a href="admin.html"><img class="me-3 ms-n3" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></a></li>
               <li class="breadcrumb-item"><a href="men_gen.html">Men&uacute;</a></li>
               <li class="breadcrumb-item"><a href="men_com.html">Comunicaci&oacute;n</a></li>
               <li class="breadcrumb-item active">Configuraci&oacute;n de los Foros</li>
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3 class="mb-3">Configuraci&oacute;n de los Foros</h3>

         <h4>Autorizar el HTML</h4>
         <p>Autorizado o prohibido (suprime) la interpretaci&oacute;n de los tags HTML.</p>

         <h4>Autorizar caritas</h4>
         <p>Autoriza la inserci&oacute;n de caritas en los Foros.</p>

         <h4>Autorizar las Firmas</h4>
         <p>Permite autorizar la utilizaci&oacute;n de las firmas para los miembros en las publicaciones de los foros.</p>

         <h4>L&iacute;mite m&aacute;ximo para que un tema sea &quot;popular&quot;</h4>
         <p>Permite definir el l&iacute;mite m&aacute;ximo arriba del cual se considera un tema como &quot;popular&quot;.</p>

         <h4>Cu&aacute;ntas contribuciones por p&aacute;gina</h4>
         <p>Es la cantidad de contribuciones por tema que ser&aacute; presentado por p&aacute;gina por un solo y mismo asunto</p>

         <h4>Asuntos por foro</h4>
         <p>Es la cantidad de temas por foro que se activar&aacute; para un s&oacute;lo y mismo foro.</p>

         <h4>Activar la selecci&oacute;n de las contribuciones &quot;resueltas&quot;</h4>
         <p>Activa la selecci&oacute;n y la visualizaci&oacute;n del v&iacute;nculo [ (solo/sin) Resuelto ].</p>

         <h4>Contribuciones m&aacute;ximas por IP y por per&iacute;odo de 30 minutos</h4>
         <p>(0=systema inactivo)<br />
            Esta opci&oacute;n les permite especificar el n&uacute;mero m&aacute;ximo de mensajes que una misma direcci&oacute;n IP O un mismo miembro puede fijar durante:<br />
            <ul>
               <li>un primer per&iacute;odo de 30 minutos</li>
               <li>un segundo per&iacute;odo de 90 minutos (en este caso es el doble de este valor que se utiliza)
               <li>0 o vac&iacute;o equivale a desactivar el sistema</li>
            </ul>
         </p>

         <h4>Activar el upload en los foros</h4>
         <p>Permite activar la posibilidad de almacenar ficheros directamente en los foros. Podr&aacute; autorizar esta funci&oacute;n que en algunos de sus foros (v&eacute;a Administraci&oacute;n/Edici&oacute;n de los Foros).</p>

         <h4>Activar los textos ocultos en los foros</h4>
         <p>Permite activar la posibilidad de ocultar una parte del texto de un mensaje en los foros utilizando las balizas [hide] Ei texto que debe ocultarse [/hide].</p>

         <h4>Texto para el rol X</h4>
         <p>El foro es capaz de indicar un texto espec&iacute;fico en funci&oacute;n del rol de un miembro. Los tags Multi-idioma son soportados en estas zonas.</p>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Manual de administraci&oacute;n</span></p>
      </div>
   </body>
</html>