<!DOCTYPE html>
<html lang="es">
   <head>
      <meta charset="utf-8" />
      <title>Base de datos de los Vinculos y Enlaces</title>
      <meta name="viewport" content="width=device-width, initial-scale=1" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="../../lib/bootstrap/dist/css/bootstrap-icons.css" />
      <link rel="stylesheet" href="../../lib/font-awesome/css/all.min.css" />
   </head>
   <body>
      <div class="container">
         <nav class="my-3">
            <ol class="breadcrumb bg-transparent">
               <li><a href="admin.html"><img class="me-3 ms-n3" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy" /></a></li>
               <li class="breadcrumb-item"><a href="men_gen.html">Men&uacute;</a></li>
               <li class="breadcrumb-item"><a href="men_contenu.html">Contenido</a></li>
               <li class="breadcrumb-item active">Enlaces Web</li>
            </ol>
         </nav>
         <hr class="mt-n3" />
         <h3 class="mb-3">Base de datos de los Vinculos</h3>
         <p>La base de datos de los vinculos es una funcion importante de NPDS. su mantenimiento es simple pero necesitando de un cierto rigor <br />
         Esta opcion le permite crear una base de datos de vinculos internet, con un motor de busqueda como Yahoo por ejemplo.</p>

         <h4>Vinculos en espera de validacion</h4>
         <p>Dispondra de esta opcion solamente si un vinculo esta en espera (sic ...).<br />
         Puede modificar el titulo, la URL e incluso su comentario, el nombre y el correo de quien lo sugirio, la categoria.<br />
         Puede enfin decidir si publicarlo o no. (Boton A&ntilde;adir)  (<i>Vinculo borrar </i>).</p>
         <h4>Limpiar la base de datos</h4>
         <p>Esta opcion le permite poner a cero la totalidad de los votos de los usuarios.</p>

         <h4>Se&ntilde;alizacion de v&iacute;nculos rotos</h4>
         <p>Las ociones aplicables a la lista son :
            <ul>
               <li>Ignorar permite borrar todas las solicitudes para un v&iacute;nculo dado.</li>
               <li>Borrar permite borrar los v&iacute;nculos rotos y los dict&aacute;menes para un v&iacute;nculo dado.</li>
            </ul>
         </p>

         <h4>Se&ntilde;alizacion de modificacion de vinculos</h4>
         <p>Para cada v&iacute;nculo, tendr&aacute; el origen (actualmente almacenado en la base) y la propuesta de modificaci&oacute;n. Las opciones aplicables son:
            <ul>
               <li>Ignorar permite borrar todas las solicitudes para un v&iacute;nculo dado.</li>
               <li>Borrar permite borrar los v&iacute;nculos rotos y los dict&aacute;menes para un v&iacute;nculo dado.</li>
               <li>presionar el v&iacute;nculo Autor o Proprietario para enviar un Correo electr&oacute;nico.</li>
            </ul>
         </p>

         <h4>A&ntilde;adir una categoria principal</h4>
         <p>Para la estructuraci&oacute;n del &iacute;ndice, se&ntilde;ale un t&iacute;tulo y una descripci&oacute;n (clasificaci&oacute;n por orden alfab&eacute;tico).</p>

         <h4>A&ntilde;adir una subcategor&iacute;a</h4>
         <p>Para la estructuraci&oacute;n del &iacute;ndice, se&ntilde;ale una subcategor&iacute;a destinada a una categor&iacute;a principal (un &uacute;nico nivel/clasificaci&oacute;n por orden alfab&eacute;tico).</p>

         <h4>A&ntilde;adir un nuevo v&iacute;nculo</h4>
         <p>Coja el t&iacute;tulo (seguido de las balizas HTML (Br, img src (local o distante)...) si lo desean), la URL, la categor&iacute;a (y subcategor&iacute;a), la descripci&oacute;n, el nombre del proprietario y su correo electr&oacute;nico. Presione el bot&oacute;n <strong>a&ntilde;adir</strong>.</p>

         <h4>Modificar la categor&iacute;a</h4>
         <p>Esta funci&oacute;n les permite modificar el nombre de una categor&iacute;a y/o subcategor&iacute;a.<br />
         Permite tambi&eacute;n suprimir una categor&iacute;a y/o subcategor&iacute;a y todos los elementos adjuntos (con mensaje de confirmaci&oacute;n).</p>

         <h4>Modificar los vinculos</h4>
         <p>NPDS les presenta la lista de los v&iacute;nculos actualmente disponibles en la base. Presione un v&iacute;nculo para publicarlo.<br />
         Pueden modificar toda la informaci&oacute;n, incluido el n&uacute;mero de hits (para colocar m&aacute;s ventajosamente un v&iacute;nculo...). pueden tambi&eacute;n borrar el v&iacute;nculo seleccionado.</p>
         <p class="border-top mt-4 text-end pt-2"><img class="me-2" width="32" height="32" src="../../images/admin/message_npds.png" alt="logo_npds" loading="lazy"><span class="text-body-secondary font-italic small float-end">NPDS - Manual de administraci&oacute;n</span></p>
      </div>
   </body>
</html>