<html>
   <head>
      <meta charset="utf-8">
      <title>Administration - npds_twi</title>
      <meta name="viewport" content="width=device-width, initial-scale=1">
      <link rel="stylesheet" href="/lib/bootstrap/dist/css/bootstrap.min.css" />
      <link rel="stylesheet" href="/lib/font-awesome/css/font-awesome.min.css" />
   </head>
   <body>
      <div class="container">
Ce module n&eacute;cessite l'ouverture d'un compte twitter et la cr&eacute;ation d'une application Twitter pour l'utilisation des APIs sur votre site.<br />
- Si vous n'avez <b>PAS</b> ces &eacute;l&eacute;ments, suivez la proc&eacute;dure ci-dessous.<br />
<br />
<h4>Proc&eacute;dure Twitter</h4>
1. Inscrivez vous sur twitter en tant qu'utilisateur <a href="http://twitter.com/">ICI</a>.<br />
<br />
1.1 Inscrivez vous en tant que développeur <a href="https://developer.twitter.com/">ICI</a>.<br />
<br />

2. Cr&eacute;ez l'application :<br />
2.1 Cr&eacute;ez l'application (passerelle entre NPDS et Twitter) <a href="https://developer.twitter.com/en/apps/create">ICI</a> :<br />
Pendant la cr&eacute;ation de l'application, pour les non-anglophones, les infos REQUISES &agrave; renseigner sont les suivantes :<br />
- App Name : Nom au choix de votre application (Exemple, <code>"Passerelle NPDS-Twi"</code>. Seule restriction : Ne doit pas contenir le mot "twitter")<br />
- Application description : Idem, saisie libre. Par exemple : "Passerelle NPDS-Twitter"<br />
- Tell us how this app will be used : Par exemple : "This application will be used to automatically publish tweets when there is new publication in our CCMS."<br />
- Website URL : l'url du site sur lequel vous installez npds_twi<br />

- Les autres champs sont facultatifs. .<br />
<br />
2.2 Param&eacute;trage de l'application Twitter :<br />
- Une fois l'application cr&eacute;&eacute;e, allez dans l'onglet "Permissions" de l'application.<br />
- Dans la section "Application type", pour le param&egrave;tre "Access", cochez "Read and write".<br />
- Cliquez sur "Update this Twitter application's settings" pour valider.<br />
- Cliquez sur l'onglet "Details"<br />
- Cliquez sur "Create my access token". Si c'est d&eacute;j&agrave; le cas, cliquez sur "Recreate my access token"<br />
Attention! Cela va modifier les clefs "Access token". Si vous les avez d&eacute;j&agrave; saisies pr&eacute;c&eacute;demment dans npds_twi, il faut les ressaisir.<br />
<br />
3. R&eacute;cup&eacute;rez vos clefs et jetons (requis pour le paramr&eacute;trage de votre module).<br />
<br />
4. Vous avez maintenant les &eacute;l&eacute;ment n&eacute;cessaires au fonctionnement de cette passerelle :<br />
- Votre clef de consommateur (Consumer key)<br />
- Votre code secret de consommateur (Consumer secret)<br />
- Jeton d'acc&egrave;s pour Open Authentification (Access token)<br />
- Jeton d'acc&egrave;s secret pour Open Authentification (Access token secret)<br />
<br />
<br />

5. Allez à l'administration du module<br />

/admin.php?op=Extend-Admin-SubModule&ModPath=npds_twi&ModStart=admin/npds_twi_set<br />

- Un message vous informera si la publication est autorisé pour le site (par defaut à Non).
(pour modifier cette autorisation supérieure suivez le lien)<br />
/admin.php?op=Configure<br />
Préferences > Configuration des infos en Backend & Réseaux Sociaux > activer Twitter<br />

- Activez ou pas la publication des news sur twitter<br />
- Choisissez un raccourciceur d'url<br />
- Remplissez les 4 champs avec les paramètres twitter (cf4) ...<br />
<br />

Notes :<br /> 
Si vous souhaitez utiliser npds_twi sur plusieurs sites NPDS, mais avec un seul compte twitter,<br />
nous vous conseillons de cr&eacute;er une application twitter par site NPDS. Cela vous permettra d'avoir &agrave;<br />
chaque fois les url WebSite et Callback correctement renseign&eacute;es.<br />
<br />

Il existe trois solutions impl&eacute;ment&eacute;es pour raccourcir les urls sans passer par un service ext&eacute;rieur.
Deux de ces solutions (cf.b cf.c) utilisent un fichier .htaccess l'autre est uniquement en php et native pour NPDS (cf.a)<br />

a - La solution recommand&eacute;e (coch&eacute;e par d&eacute;faut) est : R&eacute;&eacute;criture d'url avec contr&ocirc;leur Npds.<br /><br />
b - Si vous choisissez: R&eacute;&eacute;criture d'url avec mod_rewrite<br />
Il vous faut modifier (ou cr&eacute;er s'il n'existe pas) le fichier .htaccess (&agrave; la racine de votre site) comme suit :<br />
<code>
RewriteEngine on<br />
RewriteRule ^s([0-9]+)$ /article.php?sid=$1[L]
</code>
<br />
Nota : la premi&egrave;re ligne est inutile si elle existe d&eacute;j&agrave; dans votre fichier, la deuxi&egrave;me ligne est requise.<br />
<br />
c - Si vous choisissez : R&eacute;&eacute;criture d'url avec ForceType
Il vous faut modifier (ou cr&eacute;er s'il n'existe pas) le fichier .htaccess (&agrave; la racine de votre site) comme suit :<br />
<code>
&lt;FilesMatch "^s$"&gt;<br />
ForceType application/x-httpd- php<br />
SetHandler application/x-httpd-php<br />
&lt;/FilesMatch&gt;<br />
</code>


<strong>Semiautomatic installation of the module npds_twi</strong></p>
<br />
This module requires to open a twitter account and to create a Twitter application for the use of the APIs on your site.<br />
- If you already have these elements, pass directly to the point 6.<br />
- If you have <b>not</b> these elements, follow the procedure below.<br />
<br />
Twitter procedure:<br />
1. Register as user <a href="http://twitter.com/">HERE</a><br />
<br />
1.1 Register as developer <a href="https://developer.twitter.com/">ICI</a>.<br />
<br />
2. Create the application:<br />
2.1 Create the application (bridge between NPDS and Twitter) <a href="https://developer.twitter.com/en/apps/create">HERE</a>:<br />
During the creation of the application, informations to enter are:<br />

- App Name: Name of your choice for your application (example, "NDPS-Twi bridge." Only one restriction: Must not contain the word "twitter")<br />
- Application description: Same, free entry. For example: "bridge NPDS-Twitter"<br />
- Website URL: the url of the site on which you install npds_twi<br />
- Tell us how this app will be used: for example : "This application will be used to automatically publish tweets when there is new publication in our CCMS."<br />

- The others fields are not required. .<br />
<br />
2.2 Setting the twitter application:<br />
- Once the application is created, go to the "Settings" tab of the application.<br />
- In the "Application type" section, for the parameter "Access", check "Read and write."<br />
- Click on "Update this Twitter application's settings" to confirm.<br />
- Cliquez on the "Details" tab.<br />
- Click on "Create my access token". If this is already done, then click on \"Recreate my access token\"<br />
Warning! This will change the keys "Access token". If you have already entered them earlier in npds_twi, you must have to re-enter.<br />
<br />
3. Grab your keys and tokens (required for setting up your module).<br />
<br />
4. You now have the elements necessary for the operation of the bridge:<br />
- Your Consumer key (Consumer key)<br />
- Your consumer secret (Consumer Secret)<br />
- Your token for Open Authentication (Access token)<br />
- Your secret token for Open Authentication (Access token secret)<br />
<br />
5. Continue the semiautomatic installation of the bridge.<br />
<br />
6. Once installation is complete, go to the NPDS preferences, check in the Social Networks settings that twitter is enabled.<br />
<br />
notes:<br />
If you want to use npds_twi on several NPDS sites, but with a single twitter account, you should create a twitter application<br />
for each NPDS site. This will allow you to properly inform the callback url and WebSite url each time.<br />
<br />

         <center><img src="/images/admin/manuels.gif" alt="logo du manuel" /></center>
      </div>
   </body>
</html>