<div class="panel-group" id="accordion" role="tablist" aria-multiselectable="true">
  <div class="panel panel-default">
    <div class="panel-heading" role="tab" id="headingOne" style="background-color:#D9E7F4;">
      <h4 class="panel-title">
        <a data-toggle="collapse" data-parent="#accordion" href="#collapseOne" aria-expanded="true" aria-controls="collapseOne">
          C'est quoi la g&eacute;olocalisation de son bateau ?
        </a>
      </h4>
    </div>
    <div id="collapseOne" class="panel-collapse collapse in" role="tabpanel" aria-labelledby="headingOne">
      <div class="panel-body">
       <p>La g&eacute;olocalisation permet d'indiquer aux lecteurs du site o&ugrave; se trouve g&eacute;ographiquement votre bateau sur la carte Google.</p>
      </div>
    </div>
  </div>
  <div class="panel panel-default">
    <div class="panel-heading" role="tab" id="headingTwo" style="background-color:#D9E7F4;">
      <h4 class="panel-title">
        <a class="collapsed" data-toggle="collapse" data-parent="#accordion" href="#collapseTwo" aria-expanded="false" aria-controls="collapseTwo">
          Pourquoi g&eacute;olocaliser son bateau ?
        </a>
      </h4>
    </div>
    <div id="collapseTwo" class="panel-collapse collapse" role="tabpanel" aria-labelledby="headingTwo">
      <div class="panel-body">
        La g&eacute;olocalisation permet d'indiquer aux autres plaisanciers agathois o&ugrave; se trouve votre bateau. Elle vous permet de contacter votre voisin r&eacute;f&eacute;renc&eacute; &agrave; l'aide de la messagerie interne du site. Il est agr&eacute;able de savoir que son bateau va bien...<br />Quand vous &ecirc;tes en croisière, si vous indiquez votre position r&eacute;gulièrement, cela permet &agrave; votre famille, &agrave; vos amis de vous suivre.
      </div>
    </div>
  </div>
  <div class="panel panel-default">
    <div class="panel-heading" role="tab" id="headingThree" style="background-color:#D9E7F4;">
      <h4 class="panel-title">
        <a class="collapsed" data-toggle="collapse" data-parent="#accordion" href="#collapseThree" aria-expanded="false" aria-controls="collapseThree">
          Comment g&eacute;olocaliser son bateau
        </a>
      </h4>
    </div>
    <div id="collapseThree" class="panel-collapse collapse" role="tabpanel" aria-labelledby="headingThree">
      <div class="panel-body">
        <p><strong>Indispensable : il faut &ecirc;tre plaisancier inscrit du site et &ecirc;tre connect&eacute; en membre pour pouvoir localiser son bateau.</strong></p>
<p>Deux mani&egrave;res de se g&eacute;olocaliser sont propos&eacute;es.<ul>
<li>Soit en allant dans votre profil et en cliquant en bas de la page gauche sur l'icone <img alt="globe_process.png" src="modules/geoloc/images/ancre.gif" border="0" />.<br />Une fois votre bateau localis&eacute;, les coordonn&eacute;es g&eacute;ographiques de la position de votre bateau seront visibles &agrave; droite de cette icone dans votre profil.</li>
<li>Soit en cliquant sur le lien Localisation bateau du bloc Navigation</li></ul></p>
<p>Les deux liens ouvrent la fen&ecirc;tre de la carte vous pourrez vous localiser en faisant un clic gauche sur le point de la carte souhait&eacute;. Une fen&ecirc;tre s'ouvrira et vous demandera de confirmer votre enregistrement.<br />Pour modifier le positionnement, la m&ecirc;me proc&eacute;dure doit &ecirc;tre utilis&eacute;e, il vous sera propos&eacute;e un changement de position que vous validerez ou non.</p>
<p>Pour se positionner avec pr&eacute;cision, il est n&eacute;cessaire de zoomer la carte &agrave; son maximum. Ne pas oublier de cliquer sur le bouton enregistrer pour valider la position.</p>
<p>Si vous souhaitez changer votre position, l'affichage indique votre position enregistr&eacute;e et vous propose de valider la nouvelle position.
</p>
      </div>
    </div>
  </div>
</div>