<a name="top" id="top"></a><br /><br />
<span class="TITRE">Questions</span>
<br /><br />
<table cellspacing="0" cellpadding="2" width="100%" border="0">
  <tbody>
    <tr>
      <td><a href="#1">Geoloc, c'est quoi ?</a></td>
    </tr>
    <tr>
      <td><a href="#2">Quels sont les types de cartes que l'on peut afficher ?</a></td>
    </tr>
    <tr>
      <td><a href="#4">Que peut faire l'utilisateur ?</a></td>
    </tr>
    <tr>
      <td><a href="#5">Comment interpr&eacute;ter la visualisation des informations ?</a></td>
    </tr>
    <tr>
      <td><a href="#6">Comment se g&eacute;olocaliser ?</a></td>
    </tr>
  </tbody>
</table>
<br />
<table cellspacing="2" cellpadding="2" width="100%" border="0">
  <tbody>
    <tr>
      <td><span class="TITRE">R&eacute;ponses aux questions ci dessus</span></td>
    </tr>
  </tbody>
</table>
<br />
<table cellspacing="0" cellpadding="2" width="100%" border="0">
  <tbody>
    <tr>
      <td><a name="1" id="1"></a><strong>Geoloc, c'est quoi ?</strong>
<br /><br />
        <table border="0">
          <tbody>
              <tr>
                <td><img alt="GE01231008.gif" src="modules/geoloc/doc/images/GE01231008.gif" border="1" /></td>
            </tr>
              <tr align="middle">
                <td><div align="center"><strong>Le module dans l'environnement NPDS</strong></div></td>
              </tr>
            </tbody>
        </table>
        <br />
        G&eacute;oloc, cr&eacute;&eacute; par <strong>Jean-Pierre Barbary</strong> (jpb), permet la g&eacute;ocalisation des membres et des anonymes d'un site <a href="http://npds.org" target="_blank">NPDS</a>.<br />La carte visualis&eacute;e utilise les API Google map.<br />
        La visualisation est param&eacute;trable par l'utilisateur.<br />
        <br />
          <hr noshade="noshade" />
          <a href="#top">Haut de page</a><br />
      <br /></td>
    </tr>
    <tr>
      <td><a name="2" id="2"></a><strong>Quels sont les types de cartes que l'on peut afficher ?</strong><br /><br />
      Vous avez le choix entre 4 options :<br /><br />
        <table border="0">
            <tbody>
              <tr>
                <td><img alt="type_plan.gif" src="modules/geoloc/doc/images/type_plan.gif" border="1" /></td>
                <td><img alt="type_relief.gif" src="modules/geoloc/doc/images/type_relief.gif" border="1" /></td>
              </tr>
              <tr align="middle">
                <td><div align="center"><strong>Type Plan</strong></div></td>
                <td><div align="center"><strong>Type relief</strong></div></td>
              </tr>
              <tr>
                <td><img alt="type_satellite.gif" src="modules/geoloc/doc/images/type_satellite.gif" border="1" /></td>
                <td><img alt="type_mixte.gif" src="modules/geoloc/doc/images/type_mixte.gif" border="1" /></td>
              </tr>
              <tr align="middle">
                <td><div align="center"><strong>Type Satellite</strong></div></td>
                <td><div align="center"><strong>Type Mixte</strong></div></td>
              </tr>
            </tbody>
        </table>
<br />
          <hr noshade="noshade" />
          <a href="#top">Haut de page</a><br />
        <br /></td>
    </tr>
    <tr>
      <td><a name="4" id="4"></a><strong>Que peut faire l'utilisateur ?</strong><br /><br />
<strong>Choix de la carte<br />
            </strong><br />
            L'utilisateur dispose d'un certain nombre d'outils pour visualiser &agrave; sa convenance la carte. La plupart de ces outils s'escamote quand la position de la souris est &agrave; l'ext&eacute;rieur de la carte.<br /><br />
          <table border="0">
            <tbody>
              <tr>
                <td><img alt="choix_carte.gif" src="modules/geoloc/doc/images/choix_carte.gif" border="1" /></td>
              </tr>
            </tbody>
        </table>
        <br />
        Il peut modifier la pr&eacute;f&eacute;rence de la carte : voir ci dessus les diff&eacute;rents types de cartes affichables en cliquant sur le petit triangle renvers&eacute; noir puis en s&eacute;lectionnant un type de carte.<br />
        <br />
        <strong>Manipuler la carte</strong><br />
        <br />
        <table border="0">
            <tbody>
              <tr>
                <td><img alt="controle.gif" src="modules/geoloc/doc/images/controle.gif" border="1" /></td>
              </tr>
            </tbody>
          </table>
        <br />
        Ce contr&ocirc;le est l'outil qui sert &agrave; se diriger et zoomer, il a donc les quatre fl&egrave;ches pour se d&eacute;placer et un bouton au milieu de ces fl&egrave;ches permet de recentrer la carte sur l'Europe en zoom 4.<br /><br />Vous avez &eacute;galement une &eacute;chelle de zoom, en d&eacute;pla&ccedil;ant le curseur la carte sera automatiquement rafraichie. Le zoom s'effectue toujours en fonction du point central sur la carte au moment du zoom.<br /><br />
          Il est aussi possible de faire double clics souris   sur image pour zoomer. Le clic droit vous donne le zoom de rapprochement, le clic gauche, celui de l'&eacute;loignement. Attention, quand vous &ecirc;tes connect&eacute; en membre le clic droit ne vous permettra pas le zoom, il est utilis&eacute; pour se positionner.<br /><br />
          Vous pouvez &eacute;galement utiliser la molette de votre souris pour manipuler le zoom, une mire apparait alors.<br />
        En maintenant le clic gauche, la carte suit le d&eacute;placement de la souris.<br /><br />
        <strong>Echelle de la carte</strong><br /><br />
        A chaque fois que vous modifiez l'&eacute;chelle de la carte, l'&eacute;chelle est automatiquement mise &agrave; jour. Les unit&eacute;es de distance sont en miles am&eacute;ricains et en kilom&egrave;tres.<br /><br />
        <table border="0">
          <tbody>
            <tr>
              <td><img src="modules/geoloc/doc/images/echelle.gif" width="130" height="72" border="1"/></td>
            </tr>
          </tbody>
        </table><br />
<strong>Informations techniques de la carte</strong><br /><br />
        En cliquant sur le triangle <img src="modules/geoloc/doc/images/fl_d.gif" width="16" height="16" /> au pied gauche de la carte, vous avez les renseignements techniques de la carte : positionnement g&eacute;ographique du centre de la carte et des coins etc..<br />
        Exemple :<br /><br />
        <table border="0">
          <tbody>
            <tr>
              <td><img src="modules/geoloc/doc/images/coordo_tech.gif" width="414" height="90" border="1"/></td>
            </tr>
          </tbody>
        </table><br />
        Vous disposez aussi en pied de carte droit de l'affichage des coordonn&eacute;es g&eacute;ographiques pr&eacute;cises de la position de votre pointeur souris sur la carte.<br /><br />
        <strong>Choisir la g&eacute;olocalisation affich&eacute;e</strong><br /><br />
        <table border="0">
            <tbody>
              <tr>
                <td><img alt="localisation_choix.gif" src="modules/geoloc/doc/images/localisation_choix.gif" border="1" /></td>
              </tr>
            </tbody>
        </table>
        <br />
        La premi&egrave;re case &agrave; cocher affiche ou masque les membres g&eacute;or&eacute;f&eacute;renc&eacute;s connect&eacute;s.<br />
        La deuxi&egrave;me affiche ou masque les anonymes g&eacute;or&eacute;f&eacute;renc&eacute;s.<br />
        La troisi&egrave;me affiche ou masque les membres g&eacute;or&eacute;f&eacute;renc&eacute;s.<br />
        <br />
        Ces cases &agrave; cocher sont suivies du nombre de membres r&eacute;f&eacute;renc&eacute;s et du nombre d'IP identifi&eacute;es
        <br /><br />
          <hr noshade="noshade" />
          <a href="#top">Haut de page</a><br />
        <br /></td>
    </tr>
    <tr>
      <td><a name="5" id="5"></a><strong>Comment interpr&eacute;ter la visualisation des informations ?</strong><br /><br />
        <table border="0">
            <tbody>
              <tr valign="top" align="left">
                <td><img alt="tableau.gif" src="modules/geoloc/doc/images/tableau.gif" border="1" /></td>
                <td><p>Sur la droite de la carte, vous avez un tableau de synth&egrave;se des informations   de g&eacute;olocalisation qui se d&eacute;compose en deux parties.<br />
                  Ce tableau est escamotable en cliquant sur le triangle invers&eacute;.<img src="modules/geoloc/doc/images/fl_b.gif" width="16" height="16" /><br />
                  <br />
                  Les informations disponibles dans le cadre sup&eacute;rieur :<br />
                  <br />
                  <img src="modules/geoloc/doc/images/connect.gif" width="17" height="17" /> nombre total de personnes en ligne<br />
                  <img src="modules/geoloc/images/mbcg.png" width="24" height="24" /> nombre de membres g&eacute;or&eacute;f&eacute;renc&eacute;s en ligne<br />
                  <img src="modules/geoloc/images/acg.png" width="24" height="24" /> nombre d'anonymes g&eacute;or&eacute;f&eacute;renc&eacute;s en ligne<br />
                  -nombre de membres non r&eacute;f&eacute;renc&eacute;s en ligne<br />
                  -nombre d'anonymes non r&eacute;f&eacute;renc&eacute;s en ligne<br />
                  <br />
                  Dans la deuxi&egrave;me partie du tableau vous avez des icones <img src="modules/geoloc/images/mbg_small.png" width="16" height="16" /> <img src="modules/geoloc/images/mbcg_small.png" width="16" height="16" />  qui sont affich&eacute;es selon vos choix (voir ci dessus cases &agrave; cocher). Ces icones sont int&eacute;ractives avec la carte.<br />
                  Il est possible d'afficher la liste de tous les membres g&eacute;or&eacute;f&eacute;renc&eacute;s et de visualiser en cons&eacute;quence la position d'un membre s&eacute;lectionn&eacute; en cliquant sur son icone qu'il soit ou non connect&eacute;.<br />
                  <br />
                  Cette op&eacute;ration vous positionne automatiquement sur la carte et ouvre une fen&ecirc;tre d'informations sur le membre. Il est conseill&eacute; de bien zoomer la carte avant de faire cette op&eacute;ration.<br />
                  <br />
                Les IP de personnes non identifi&eacute;es sont &eacute;galement affich&eacute;es. <img src="modules/geoloc/images/ip_ng.png" width="32" height="32" /></p></td>
              </tr>
            </tbody>
        </table>
        <br />
        <strong>Les deux types de fen&ecirc;tres affich&eacute;es sur la carte :</strong><br />
        <br />
          <table border="0">
            <tbody>
              <tr>
                <td><img alt="fenetre_paslig.gif" src="modules/geoloc/doc/images/fenetre_paslig.gif" border="0" /></td>
                <td><img alt="fenetre_enligne.gif" src="modules/geoloc/doc/images/fenetre_enligne.gif" border="0" /></td>
              </tr>
              <tr align="middle">
                <td><div align="center"><strong>Fen&ecirc;tre membre g&eacute;olocalis&eacute; hors ligne</strong></div></td>
                <td><div align="center"><strong>Fen&ecirc;tre membre g&eacute;olocalis&eacute; connect&eacute;</strong></div></td>
              </tr>
            </tbody>
        </table>
        <br />
        Vous pouvez consulter le profil du membre inscrit et la date de sa derni&egrave;re connexion au site est affich&eacute;e.<br />
        Si le membre est connect&eacute;, vous pouvez en plus lui envoyer un message priv&eacute; en cliquant sur la petite enveloppe.<br /><br />
        
        <hr noshade="noshade" />
          <a href="#top">Haut de page</a><br />
      <br /></td>
    </tr>
    <tr>
      <td><a name="6" id="6"></a><strong>Comment se g&eacute;olocaliser ?</strong><br /><br />
Pour se g&eacute;olocaliser, il faut &ecirc;tre membre inscrit du site.<br />
              <br />
            Deux mani&egrave;res de se g&eacute;olocaliser sont offertes.<br />
            Soit en allant dans votre profil et en cliquant en bas de la page gauche sur l'icone <img alt="globe_process.png" src="modules/geoloc/images/globe_process.png" border="0" /> . Une fois g&eacute;olocalis&eacute;, vos coordonn&eacute;es g&eacute;ographiques seront visibles &agrave; droite de cette icone dans votre profil.<br />
            <br />
            Soit en cliquant sous la carte miniature du bloc sur le lien carte<br />
            <br />
            Les deux liens ouvrent la fen&ecirc;tre de la carte vous pourrez vous localiser en faisant un clic gauche sur le point de la carte souhait&eacute;. Une fen&ecirc;tre s'ouvre et vous demande de confirmer votre enregistrement. Pour modifier le positionnement, la m&ecirc;me proc&eacute;dure doit &ecirc;tre utilis&eacute;e.<br />
            <br />
        <table border="0">
            <tbody>
              <tr>
                <td><img alt="senregistrer.gif" src="modules/geoloc/doc/images/senregistrer.gif" border="0" /></td>
              </tr>
              <tr align="middle">
                <td><div align="center"><strong>Fen&ecirc;tre s'enregistrer</strong></div></td>
              </tr>
            </tbody>
        </table>
        <br />
        Pour se positionner avec pr&eacute;cision, il est n&eacute;cessaire de bien zoomer la carte. Ne pas oublier de cliquer sur le bouton enregistrer pour valider votre position.<br />
        Si vous souhaitez changer votre position, l'affichage indique votre position enregistr&eacute;e et vous propose de valider la nouvelle position.<br /><br />
          <hr noshade="noshade" />
          <a href="#top">Haut de page</a><br />
        <a href="modules.php?ModPath=geoloc&ModStart=geoloc">Retour Carte</a></td>
    </tr>
  </tbody>
</table>