<html>
<title>Module liens-Web / Multi-Base - NPDS V</title>
<head>
</head>
<body bgcolor=FFFFFF text=000000>
<font face=Verdana,Arial,Helvetica size=2>
<center><b>Module liens-Web / Multi-Base</b></center>
<br /><br />
La base de Liens Web est une fonction importante de NPDS. Sa maintenance est simple mais n&eacute;cessite une certaine rigueur.<br />
Elle permet la cr&eacute;ation d'un index de type Yahoo avec un moteur de recherche autonome du reste du site.
<br /><br />
<b>Liens en attente de Validation :</b><br />
Vous disposerez de cette option que si un lien est en attente (sic ...).<br />
Vous pouvez modifier le titre, le lien et son commentaire, le nom et l'email du d&eacute;positaire, la cat&eacute;gorie.<br />
Vous pouvez enfin choisir de publier le lien (bouton <i>Ajouter</i>) ou de le supprimer (<i>lien Supprimer</i>).
<br /><br />
<b>Soummission de liens bris&eacute;s :</b><br />
Les options applicables &agrave; la liste sont :<br />
 - <i>Ignorer</i> permet d'effacer toutes les demandes pour un lien donn&eacute;.<br />
 - <i>Effacer</i> permet d'effacer les liens cass&eacute;s et les avis pour un lien donn&eacute;.<br />
 - cliquer sur le lien Auteur pour envoyer un Email.
<br /><br />
<b>Soumission de modification de liens :</b><br />
Pour chaque lien, vous aurez l'origine (actuellement stock&eacute; dans la base) et la proposition de modification.
Les options applicables sont :<br />
 - <i>Ignorer</i> permet d'effacer toutes les demandes pour un lien donn&eacute;.<br />
 - <i>Effacer</i> permet d'effacer les liens cass&eacute;s et les avis pour un lien donn&eacute;.<br />
 - cliquer sur le lien Auteur ou Propri&egrave;taire pour envoyer un Email.
<br /><br />
<b>Ajouter une cat&eacute;gorie principale :</b><br />
Pour la structuration de l'index, saississez un titre et une description (classement par ordre alphab&eacute;tique).
<br /><br />
<b>Ajouter une sous-cat&eacute;gorie :</b><br />
Pour la structuration de l'index, saississez une sous-cat&eacute;gorie affect&eacute;e &agrave; une cat&eacute;gorie principale (un seul niveau / classement par ordre alphab&eacute;tique).
<br /><br />
<b>Ajouter un nouveau lien :</b><br />
Saississez le titre <b>(avec &agrave; la suite des balises html (br, img src (locale ou distante), ...) si vous le souhaitez)</b>, l'URL, la cat&eacute;gorie (et sous-cat&eacute;gorie), la description, le nom du propri&eacute;taire et son email. Cliquez sur le bouton <i>Ajouter</i>.
<br /><br />
<b>Modifier la cat&eacute;gorie :</b><br />
Cette fonction vous permet de modifier le nom d'une cat&eacute;gorie et/ou sous-cat&eacute;gorie.<br />
Elle permet aussi de supprimer une cat&eacute;gorie et/ou sous-cat&eacute;gorie et tous les &eacute;l&eacute;ments rattach&eacute;s (avec message de confirmation).
<br /><br />
<b>Modifier les liens :</b><br />
Ce module vous permet de modifier le contenu de la base (en tant qu'administrateur) directement via l'arborescence d'affichage.<br />
Vous pouvez modifier toutes les informations, y compris le nombre de hits (pour positionner plus avantageusement un liens ...).
Vous pouvez aussi effacer le lien s&eacute;lectionn&eacute;, les cat&eacute;gories, sous-cat&eacute;gories.
</font>
</body>
</html>
